{
    "en": {
        "home_title": "NIPSCERN - Research and Innovation | NIPSCERN Lab",
        "home_btn_search": "Search",
        "home_welcome": "Welcome to NIPSCERN",
        "home_current_research": "Current Research",
        "home_supporters": "Supporters",
        "home_about_us": "About Us",
        "home_faq": "FAQ",
        "home_contact_us": "Contact Us",
        "home_title_text": "The Fusion of Signal Processing and Particles Research",
        "home_subtitle_text": "Collaborating globally to push the boundaries of physics, technology, and innovation.",
        "home_btn_learn_more": "Learn More",
        "home_btn_explore_projects": "Explore Projects",
        "home_sapho_card": "Program processors in C+- with SAPHO: Scalable Architecture Processor for Hardware Optimization.",
        "home_read_more": "Read More",
        "home_aura_card": "A modern, functional, and beautiful IDE with embedded AI to program processors using the C+- language.",
        "home_alice_card": "A new optimized way to translate C+- code to Assembly. Fast and reliable.",
        "home_helvetia_card": "All documentation of NIPSCERN Lab. Find instructions, hints, examples, and much more.",
        "home_infinity_card": "All-in-one app that save your time after formatting your Windows. Download useful tools.",
        "home_cern_card": "Learn more about CERN, the European Organization for Nuclear Research.",
        "home_text_about_us": "NIPSCERN is at the forefront of innovation in the fields of signal processing and particles research, driving breakthroughs that reshape our understanding of the universe.",
        "home_title_our_mission": "Our Mission",
        "home_text_our_mission": "To harness cutting-edge technologies and collaborative research to advance knowledge and solve complex challenges in science.",
        "home_title_our_vision": "Our Vision",
        "home_text_our_vision": "To be a global leader in research and innovation, inspiring future generations to explore the frontiers of science.",
        "home_title_join_us": "Join Us in Our Journey!",
        "home_text_join_us": "Together, we can unlock new potentials in research and technology. Explore our projects or get involved!",
        "home_title_faq": "Frequently Asked Questions", 
        "home_text_faq_q_1": "Where is NIPSCERN Lab located?",
        "home_text_faq_a_1": "NIPSCERN Lab is located at Universidade Federal de Juiz de Fora, in the state of Minas Gerais, Brazil.",
        "home_text_faq_q_2": "Which projects has NIPSCERN developed?",
        "home_text_faq_a_2": "We have developed a variety of projects like AURA IDE, SAPHO, Infinity Manager, and much more.",
        "home_text_faq_q_3": "How can I help the lab?",
        "home_text_faq_a_3": "You can join us on our GitHub located at the footer.",
        "home_title_get_touch": "Get in Touch",
        "home_text_send_message": "Send Message",
        "home_text_contact_info": "Contact Information",
        "home_privacy_policy": "Privacy Policy",
        "home_terms_service": "Terms of Service",
        "home_footer_license": "This work is licensed under a",
        
        
        "cern_title": "CERN History and ATLAS Project | NIPSCERN Lab",
        "cern_nav_history": "History of CERN",
        "cern_nav_atlas": "ATLAS Project",
        "cern_nav_media": "Media & Resources",
        "cern_nav_references": "References",
        "cern_header_text": "CERN History & ATLAS Project",
        "cern_subtitle": "Understanding the universe through particle physics.",
        "cern_intro_text": "History of CERN",
        "cern_intro_cern": "CERN, the European Organization for Nuclear Research, was founded in 1954 by 12 European countries in an effort to establish a world-class research facility to explore the mysteries of the universe. Today, it is one of the world’s largest and most respected centers for scientific research, with 23 member states and numerous global partnerships. CERN is primarily located in Geneva, Switzerland, with its facilities straddling the Franco-Swiss border.",
        "cern_intro_mission": "CERN's mission is to provide physicists with the necessary tools and infrastructure to conduct groundbreaking experiments in subatomic particle research, advancing our understanding of the universe. The organization has been at the forefront of several monumental scientific achievements.",
        "cern_section_location_title": "Location",
        "cern_section_location": "The main campus of CERN is located on the Franco-Swiss border, near Geneva, Switzerland. The Large Hadron Collider (LHC), the most famous of its particle accelerators, runs underground in a circular tunnel spanning 27 kilometers (17 miles), with parts of it in both Switzerland and France.",
        "cern_section_image_lhc": "Image: underground location of LHC and the four main experiments.",
        "cern_section_achievements_title": "Achievements",
        "cern_section_achievements": "CERN has contributed significantly to particle physics, not just through discoveries, but also through the development of technologies that impact society at large. One of CERN's most notable achievements is the construction of the Large Hadron Collider (LHC), the world's largest and most powerful particle accelerator, located 100 meters underground. The LHC has allowed scientists to conduct experiments that have expanded our understanding of particle physics and the forces governing the universe.",
        "cern_section_image_ccc": "Image: CERN's accelerator control center (CCC), where scientists monitor and control the operation of the Large Hadron Collider and other accelerators at the laboratory.",
        "cern_section_milestones_title": "Key Milestones",
        "cern_milestone_1954": "CERN is founded by 12 European countries.",
        "cern_milestone_1989": "Tim Berners-Lee invents the World Wide Web at CERN to meet the demand for information sharing between physicists working in different parts of the world.",
        "cern_milestone_2008": "the Large Hadron Collider (LHC), the world’s most powerful particle accelerator, begins operation.",
        "cern_milestone_2012": "discovery of the Higgs boson particle, a milestone in particle physics that confirms the existence of the Higgs field, a key element in the Standard Model of particle physics.",
        "cern_section_image_structure": "Image: a diagram showing the organizational structure of CERN, highlighting its various departments and collaborations.",
        "cern_section_discoveries_title": "Important Discoveries & Experiments",
        "cern_discovery_intro": "CERN's discoveries have revolutionized our understanding of particle physics. Here are some of the most important experiments and findings:",
        "cern_discovery_higgs_title": "The Higgs Boson Discovery (2012):",
        "cern_discovery_higgs": "one of the most famous experiments conducted at CERN was the search for the Higgs boson. This elusive particle was theorized to give mass to other particles. After decades of research, the Higgs boson was finally detected in 2012 by the ATLAS and CMS detectors at the LHC. This discovery earned scientists François Englert and Peter Higgs the Nobel Prize in Physics in 2013.",
        "cern_discovery_web_title": "The World Wide Web (1989):",
        "cern_discovery_web": "Tim Berners-Lee, a British scientist working at CERN, invented the World Wide Web as a means for researchers across the world to share and access data. This invention has since transformed communication, commerce, and global connectivity.",
        "cern_discovery_antimatter_title": "Antimatter Experiments:",
        "cern_discovery_antimatter": "CERN is also known for its research on antimatter. In 1995, CERN’s scientists created the first antihydrogen atoms. Understanding antimatter could lead to breakthroughs in fields ranging from energy to medical technology.",
        "cern_discovery_quark_gluon_title": "Quark-Gluon Plasma:",
        "cern_discovery_quark_gluon": "CERN's ALICE experiment has been instrumental in studying quark-gluon plasma, a state of matter thought to have existed just after the Big Bang. By colliding heavy ions at extreme energies, scientists at CERN recreate conditions similar to those at the birth of the universe.",
        "cern_section_curiosities_title": "Curiosities about CERN",
        "cern_curiosity_data_title": "Data Processing:",
        "cern_curiosity_data": "CERN generates huge amounts of data, approximately 30 petabytes (30 million gigabytes) annually, which are processed by a global network of computing centers.",
        "cern_curiosity_detector_title": "The Atlas Detector:",
        "cern_curiosity_detector": "the ATLAS detector at CERN is 45 meters long, 25 meters in diameter, and weighs as much as the Eiffel Tower!",
        "cern_curiosity_collaboration_title": "International Collaboration:",
        "cern_curiosity_collaboration": "CERN employs scientists from more than 100 different nationalities, fostering a global environment for scientific progress.",
        "cern_curiosity_black_holes_title": "Black Hole Theories:",
        "cern_curiosity_black_holes": "some experiments at CERN have led to speculation about the potential to create micro black holes, although there is no risk to Earth, as such black holes would evaporate almost instantly.",
        "cern_atlas_title": "ATLAS Project",
        "cern_atlas_experiment": "The ATLAS experiment at CERN is one of the largest and most complex experiments ever constructed in particle physics. It is a general-purpose particle detector at the Large Hadron Collider (LHC), designed to explore the fundamental particles and forces that make up the universe. With a collaboration of thousands of scientists from all over the world, ATLAS is helping to answer some of the biggest questions in physics.",
        "cern_atlas_discovery": "ATLAS was instrumental in the discovery of the Higgs boson in 2012, a groundbreaking discovery that confirmed the existence of the Higgs field, a key component of the Standard Model of particle physics. Beyond the Higgs boson, ATLAS aims to detect a wide variety of phenomena, such as extra dimensions, supersymmetry, and particles that could explain the mysterious dark matter that makes up much of the universe.",
        "cern_atlas_location": "Located 100 meters underground, the ATLAS detector is 46 meters long, 25 meters in diameter, and weighs around 7,000 tons. Its vast size allows it to capture a wide range of particle interactions, providing researchers with invaluable data to further understand the subatomic world.",
        "cern_atlas_nipscern_title": "NIPSCERN's Contribution to ATLAS",
        "cern_atlas_nipscern": "The NIPSCERN Lab is actively involved in the ATLAS project. Researchers from the lab contribute to the analysis of the massive amounts of data generated by the particle collisions at the LHC. Using advanced computational tools and algorithms, NIPSCERN scientists help process and interpret the data, which is essential in identifying rare and significant particle interactions.",
        "cern_atlas_experiment_image": "Image: a view of the ATLAS experiment’s immense particle detector during construction at CERN. The detector spans 46 meters in length and is responsible for capturing data from high-energy particle collisions at the LHC.",
        "cern_atlas_goal_title": "Objectives of the ATLAS Project",
        "cern_atlas_study_title": "Study the Higgs Boson:",
        "cern_atlas_study": "following the discovery of the Higgs boson, ATLAS continues to study its properties in more detail to better understand how particles acquire mass.",
        "cern_atlas_search_title": "Search for Dark Matter:",
        "cern_atlas_search": "one of ATLAS's most ambitious goals is to discover particles that could explain dark matter, an invisible form of matter that makes up roughly 27% of the universe.",
        "cern_atlas_susy_title": "Investigate Supersymmetry (SUSY):",
        "cern_atlas_susy": "ATLAS searches for evidence of supersymmetry, a theory that extends the Standard Model by predicting the existence of partner particles for every known particle, which could help solve mysteries like dark matter and unify forces.",
        "cern_atlas_string_title": "Explore Extra Dimensions:",
        "cern_atlas_string": "the experiment looks for signs of extra spatial dimensions, which theories like string theory suggest may exist beyond the three spatial dimensions we perceive.",
        "cern_discovery_title": "Significant Discoveries and Research Areas",
        "cern_discovery_subtitle": "In addition to the Higgs boson, ATLAS has produced significant insights in many areas of particle physics. Here are some notable contributions:",
        "cern_measurement_title": "Precision Measurements:",
        "cern_measurement": "ATLAS has made precise measurements of Standard Model processes, such as the production of W and Z bosons, which help refine our understanding of fundamental forces.",
        "cern_quark_title": "Top Quark Studies:",
        "cern_quark": "ATLAS has provided key data on the top quark, the heaviest known elementary particle, which plays a crucial role in testing the Standard Model.",
        "cern_model_title": "New Physics Beyond the Standard Model:",
        "cern_model": "ATLAS continues to explore potential new particles and forces beyond the Standard Model, such as hypothetical particles related to dark matter or exotic forms of matter like quark-gluon plasma.",
        "cern_discovery_image": "Image: ATLAS provides first measurement of the W-boson width at the LHC.",
        "cern_facts_title": "Interesting Facts about ATLAS",
        "cern_scale_title": "Scale of Collaboration:",
        "cern_scale": "ATLAS involves around 3,000 scientists from over 180 institutions in 38 countries, making it one of the most collaborative scientific projects in history.",
        "cern_data_title": "Data Volume:",
        "cern_data": "the ATLAS experiment produces a massive amount of data – over 10 petabytes per year, requiring advanced computing networks across the globe to process the information.",
        "cern_detector_title": "Complexity of the Detector:",
        "cern_detector": "ATLAS is composed of multiple layers of different types of detectors that measure various particle properties, including their paths, energy, and momentum.",
        "cern_media_resources": "Media & Resources",
        "cern_media_resources_subtitle": "For more detailed insights into CERN's work, watch the videos above or explore additional articles and resources below.",
        "cern_media_references": "References",
        "cern_media_references_title": "This page includes information from a variety of sources, offering both detailed insights and easy-to-understand resources about CERN and the ATLAS project:",
        "cern_media_references_cern": "CERN Official Website",
        "cern_media_references_atlas": "ATLAS Experiment Overview",
        "cern_media_references_wiki": "Wikipedia - CERN",
        "cern_media_references_nature": "Nature Article on Higgs Discovery",
        "cern_media_references_wiki_atlas": "Wikipedia - ATLAS Experiment",
        "cern_media_references_higgs": "CERN Document Server - Higgs Boson Discovery Paper", 
        "cern_media_references_model": "CERN - Standard Model of Particle Physics",
        "cern_media_references_matter": "Nature - The Hunt for Dark Matter",
        "cern_media_references_exp": "CERN Experiments Overview",
        "cern_media_references_magazine": "CERN Courier Magazine",
        "cern_license": "Licensed under",
        
        
        "alice_title": "ALICE - Assembly Logical Instruction for C+- Engine | NIPSCERN Lab",
        "alice_overview": "Overview",
        "alice_compiler_flow": "Compilation Flow",
        "alice_video_diagram": "Video & Diagram",
        "alice_documentation": "Documentation",
        "alice_title_text": "*ALICE: Assembly Logical Instruction for C+- Engine",
        "alice_subtitle_text": "An innovative assembly engine optimized for C+- code, turning complex logic into optimized instructions for scalable processors.",
        "alice_documentation_text": "Go to Documentation",
        "alice_compiler_flow_text": "Compilation Flow",
        "alice_input": "Your source C+- code file, the starting point of the compilation process.",
        "alice_token": "Breaks down the input file into tokens (keywords, identifiers, etc.).",
        "alice_parser": "Analyzes token sequences based on grammar rules to create the syntax tree.",
        "alice_ast_construction_title": "AST Construction:",
        "alice_ast_construction": "Generates the Abstract Syntax Tree (AST) representing the program structure.",
        "alice_lexical_analysis_title": "Generated Lexical Analysis:",
        "alice_lexical_analysis": "The output from the lexical analyzer based on the tokens.",
        "alice_parsing_title": "Generated Parsing:",
        "alice_parsing": "Generated parsing logic, derived from the grammar rules.",
        "alice_handling_title": "Include Handling:",
        "alice_handling": "Handles all file includes specified within the source code.",
        "alice_output": "Output:",
        "alice_output_title": "Final assembly code, ready to run on the processor.",
        "alice_flow_comp_title": "The compilation transforms",
        "alice_flow_comp_inter": "into",
        "alice_flow_comp_final": "through these sequential steps.",
        "alice_flow_input_file": "This is the input file.",
        "alice_flow_exe": "Which goes directly to myccompiler.exe",
        "alice_token_process": "Here, the compiler starts tokenizing the text stream from test.cmm.",
        "alice_token_generated": "Tokens:",
        "alice_token_stream": "Next, the *ALICE compiler checks if the input stream of tokens is valid according to the grammar.",
        "alice_nodes": "Several nodes are created by the 'create_node' function. In this example, five productions/reductions are made:",
        "alice_asm_output": "Finally, the *ALICE compiler generates the ASM output code based on the nodes created by the create_node function in the previous step.",
        "alice_nodes_title": "Nodes:",
        "alice_asm_output_text": "This is the output file.",
        "alice_video_example_title": "Example Video",
        "alice_diagram_flow_title": "Compilation Flow Diagram",
        "alice_diagram_flow_button": "Show Diagram",
        "alice_features_title": "Features",
        "alice_fast_compilation_title": "Fast Compilation",
        "alice_fast_compilation": "*ALICE compiles C+- code quickly and efficiently for optimized performance.",
        "alice_multi_file_title": "Multi-file Support",
        "alice_multi_file": "Compile multiple files at once with precise error tracking by line.",
        "alice_stack_size_title": "Custom Stack Size",
        "alice_stack-size": "Adjustable stack size for faster processing and hardware optimization.",
        "alice_processor_title": "Processor Choice",
        "alice_processor": "Select between fixed-point or floating-point processor types.",
        "alice_directive_title": "Directive Management",
        "alice_directive": "Supports a wide range of directives with customizable parameters.",
        "alice_future_features": "Future Features",
        "alice_enhanced_error_title": "Enhanced Error Reporting",
        "alice_enhanced_error": "More detailed error and warning reports.",
        "alice_performance_optm_title": "Performance Optimization",
        "alice_performance_optm": "Faster compilation and built-in code optimization tips.",
        "alice_plugin_title": "Plugin System",
        "alice_plugin": "Support for add-ons and community-built tools.",
        "alice_stonks_title": "Statistical Insights",
        "alice_stonks": "Data-driven suggestions for code improvements.",
        "alice_security_title": "Security Enhancements",
        "alice_security": "Improved reliability and security features.",
        "alice_alice_documentation_title": "ALICE Documentation",
        "alice_alice_documentation": "Find detailed information and guides about the ALICE Assembly Logical Instruction for C Engine.",
        "alice_alice_documentation_button": "Read Documentation",
        "alice_alice_license": "Licensed under",

        
        "infinity_title": "Infinity Manager | NIPSCERN Lab",
        "infinity_initial_title": "Infinity",
        "infinity_final_title": "Manager",
        "infinity_subtitle": "Download Manager for NIPSCERN Lab Tools",
        "infinity_welcome_title": "Welcome to Infinity Manager, the dedicated download manager for the NIPSCERN Lab. Designed with researchers and developers in mind, Infinity Manager simplifies the process of accessing essential software tools required for innovative projects in the fields of signal processing and computational research.",
        "infinity_summary_1": "The primary goal of Infinity Manager is to streamline software installation and management for users at NIPSCERN Lab. By providing a centralized platform to download, install, and update various software applications, Infinity Manager enhances productivity and ensures that all users have easy access to the latest tools necessary for their work.",
        "infinity_summary_2": "Infinity Manager also promotes collaboration within the lab by allowing easy sharing and distribution of software among team members. With an intuitive user interface and comprehensive documentation, users can effortlessly navigate through the available software options, ensuring they have the right tools at their fingertips for successful project completion.",
        "infinity_available_software_title": "Available Software:",
        "infinity_available_software": "and more coming soon.",
        "infinity_future_software": "Future Software Availability: At Infinity Manager, we are committed to continuously expanding our software offerings to ensure you have access to the most effective tools for your development and productivity needs. In the future, we aim to include even more programs that cater to various aspects of software development, data analysis, design, and collaboration. Stay tuned for updates on new additions that will further enhance your workflow and support your projects at NIPSCERN Lab.",
        "infinity_open_source": "Importance of Open Source Software: Open source software plays a vital role in today’s technological landscape. By providing access to source code, it encourages transparency, collaboration, and innovation. Open source programs empower developers to modify and improve software according to their unique needs, fostering a community-driven approach to problem-solving.",
        "infinity_do_more": "Explore, Contribute, and Innovate: As we build the Infinity Manager platform, we invite you to explore the current offerings and provide feedback on what tools you find most valuable. Together, we can create a resource that not only meets your needs but also contributes to the thriving open source ecosystem.",
        "infinity_thanks": "Thank you for choosing Infinity Manager — your gateway to essential software solutions for the NIPSCERN Lab.",
        "infinity_find_us": "Find us",
        "infinity_learn_more": "Learn More",
        "infinity_learn_more_cern": "About CERN",
        "infinity_visit": "Visit",
        "infinity_visit_cnpq_ufjf": "CNPq and UFJF",
        "infinity_licensed": "NIPSCERN is Licensed Under CC BY-NC-SA 4.0",
        
        
        "privacy_title": "Privacy Policy | NIPSCERN Lab",
        "privacy_policy_title": "Privacy Policy",
        "privacy_last_updated": "Last updated: 10.09.2024",
        "privacy_subtitle": "At NIPSCERN Lab, we respect your privacy and are committed to maintaining transparency. We do not collect, store, or process any personal data from our users.",
        "privacy_data_collection_title": "1. Data Collection",
        "privacy_data_collection": "NIPSCERN Lab does not collect any personal information from visitors or users. We do not use cookies, tracking mechanisms, or analytics tools that gather personal data.",
        "privacy_third_party_title": "2. Third-Party Links",
        "privacy_third_party": "Our website may contain links to third-party websites, including our partners like CNPq, UFJF, and CERN. We encourage you to review their privacy policies before engaging with them.",
        "privacy_open_source_title": "3. Open Source Philosophy",
        "privacy_open_source": "All projects developed at NIPSCERN Lab are open-source. We do not track or monitor who accesses or downloads our software.",
        "privacy_rights_title": "4. Your Rights",
        "privacy_rights": "Since we do not collect any data, there are no user rights related to personal information in our systems.",
        "privacy_contact_title": "5. Contact Information",
        "privacy_contact": "For any questions regarding this privacy policy, please reach out to us at contact@nipscern.com.",
        "privacy_back": "Back to Main Page",

        
        "service_title": "Terms of Service | NIPSCERN Lab",
        "service_terms_service_title": "Terms of Service",
        "service_last_updated": "Last updated: 10.09.2024",
        "service_welcome": "Welcome to NIPSCERN Lab! Our mission is to build high-quality, open-source projects. By accessing or using our website, you agree to these Terms of Service.",
        "service_acceptance_terms": "1. Acceptance of Terms",
        "service_acceptance_text": "By accessing and using NIPSCERN Lab’s website or projects, you agree to comply with and be bound by these terms.",
        "service_open_source_projects": "2. Use of Open-Source Projects",
        "service_open_source_text": "All projects developed by NIPSCERN Lab are open source and available for use under relevant open-source licenses.",
        "service_disclaimer_warranties": "3. Disclaimer of Warranties",
        "service_disclaimer_text": "NIPSCERN Lab provides its website, projects, and software \"as is\". We do not guarantee the reliability or functionality of the software we release.",
        "service_collaborations": "4. Collaborations",
        "service_collaborations_text": "We are proud to collaborate with CNPq, UFJF, and CERN. However, NIPSCERN Lab operates independently and is not liable for the policies or practices of these organizations.",
        "service_limitation_liability": "5. Limitation of Liability",
        "service_limitation_text": "NIPSCERN Lab shall not be liable for any damages resulting from the use or inability to use our software or website.",
        "service_changes_terms": "6. Changes to the Terms",
        "service_changes_text": "We reserve the right to update these terms. Continued use of our website after changes have been made constitutes acceptance of the revised terms.",
        "service_contact_information": "7. Contact Information",
        "service_contact_text": "For any questions regarding these Terms of Service, please contact us at contact@nipscern.com.",
        "service_back": "Back to Main Page",
        
        
        "sapho_title": "SAPHO - Scalable Architecture Processor for Hardware Optimization | NIPSCERN Lab",
        "sapho_nav_introduction": "Introduction",
        "sapho_nav_ide": "IDE",
        "sapho_nav_compiler": "Compilers",
        "sapho_nav_media": "Media & Resources",
        "sapho_nav_references": "References",
        "sapho_subtitle": "Scalable Architecture Processor for Hardware Optimization.",
        "sapho_documentation": "Go to Documentation",
        "sapho_introduction_title": "SAPHO: an Introduction",
        "sapho_introduction": "The fixed architecture of currently available Processor Soft Cores (PSCs) is a common characteristic among them. This means that the same amount of hardware resources is allocated regardless of the embedded program. Furthermore, the word size is fixed and is typically oversized. This website presents a scalable soft-core processor developed at the Signal Processing and Instrumentation Core of the Engineering Faculty at UFJF (Federal University of Juiz de Fora).",
        "sapho_overview_title": "Overview of SAPHO",
        "sapho_overview_open-source": "SAPHO, which stands for Scalable Architecture Processor for Hardware Optimization, is an open-source soft-core processor designed to automatically allocate necessary hardware resources during the compile time of embedded programs. It is primarily used in multi-core processing frameworks and has been implemented in various established systems.",
        "sapho_overview_compilers": "The functionality of SAPHO is based on its two compilers, accessible through its main Integrated Development Environment (IDE). The first compiler, C+−, is responsible for interpreting programs written in a subset of the C language and converting them into Assembly language. The second compiler takes the Assembly code generated by the first compiler and translates it into machine code, allocating the required hardware resources and generating a configuration file in Verilog.",
        "sapho_overview_assembler": "The assembler first identifies the instructions produced by the user-written program and then creates only the hardware resources needed for execution. Most configurations, such as the development of internal circuits for the Arithmetic Logic Unit (ALU), are automated. Programmers can modify additional features, including word size, ALU type (fixed-point or floating-point), and the number of input and output ports, using compilation directives.",
        "sapho_overview_psc": "A key distinction between SAPHO and available PSCs lies in its ability to adjust its architecture based on the implemented program. However, it loses the ability to update the program during runtime. Nonetheless, in many current applications, the advantages of resource optimization justify this limitation.",
        "sapho_description_title": "Description of SAPHO",
        "sapho_description_harvard": "SAPHO is based on a Harvard architecture and features a Reduced Instruction Set Computer (RISC) design, which allows it to determine the necessary hardware resources based on the user's application. The Arithmetic Logic Unit (ALU) within SAPHO can be configured for both fixed-point and floating-point operations, and its memory systems—both data and program—feature self-scaling addresses.",
        "sapho_description_tools": "In addition to the processor itself, which includes its core and two memory units, several tools have been developed to facilitate programming. These tools include a development interface, a compiler that interprets a subset of the C language known as C+−, and an assembler.",
        "sapho_advantages_title": "Some of the advantages of using the SAPHO processor include:",
        "sapho_advantages_instruction_title": "Single Instruction Execution per Clock Cycle:",
        "sapho_advantages_instruction": "it can execute one instruction per clock cycle, even in routines with conditional jumps, without disrupting the pipeline, thanks to its three-stage pipeline architecture.",
        "sapho_advantages_alu_title": "Configurable ALU:",
        "sapho_advantages_alu": "the ALU can be adjusted for variable word sizes and can handle both fixed-point and floating-point operations.",
        "sapho_advantages_resource_title": "Parameterized Resource Allocation:",
        "sapho_advantages_resource": "resources are allocated in a parameterized manner at design time, tailored to the specific application developed.",
        "sapho_advantages_flexibility_title": "Programming Flexibility:",
        "sapho_advantages_flexibility": "users can program the processor using either a subset of the C language or directly in Assembly language.",
        "sapho_architecture_title": "Hardware Architecture of SAPHO",
        "sapho_architecture_blocks": "The primary blocks of the SAPHO architecture are illustrated in Figure 1, where solid lines indicate the flow of data, and dashed lines represent control signals. The light yellow blocks are instantiated automatically on demand, depending on the embedded program, while the light blue blocks are always instantiated. As both memory units are synchronous, the three pipeline stages required by the processor are depicted in Figure 2.",
        "sapho_architecture_data": "Pointers for the data stack and instruction stack (Stack Pointer and Instruction Pointer) manage the read and write operations in their respective stacks, which are shared between the data and program memories. In the data memory, the stack is used for temporary data storage via PUSH and POP instructions and their variants. In the program memory, the stack enables the use of subroutines with CALL and RETURN instructions.",
        "sapho_architecture_circuits": "When the ALU is configured for floating-point operations, transformation circuits between fixed-point and floating-point representations are automatically instantiated on the input and output buses, allowing the processor to communicate with I/O devices using integers in two's complement notation.",
        "sapho_architecture_block_image": "Image: SAPHO Processor Block Diagram (1).",
        "sapho_architecture_pipeline_image": "Image: diagram of pipeline stages executed by SAPHO (2).",
        "sapho_architecture_explanation": "Below you can see a more detailed explanation of each processor block shown in Figure 1.",
        "sapho_architecture_program": "Data and Program Memory",
        "sapho_code": "As previously mentioned, the sizes of the data and program memories are determined by the written code. The assembly compiler calculates the number of addresses required to store all instructions and variables from the program code, thus parameterizing the instance of the memories. The assembler generates the content of these memories and saves it in memory initialization files (with a .mif extension), which are instantiated in the FPGA along with the processor hardware.",
        "sapho_program_counter": "Program Counter - PC",
        "sapho_program_counter_text": "This block points to the location of the instruction in memory to be read from the program memory. During normal program execution, it is incremented after each instruction. When a jump instruction is detected, it is loaded with a specific value that refers to the next instruction. The size, in bits, of the PC is defined by the assembly compiler based on the size of the program memory.",
        "sapho_prefetch": "Prefetch",
        "sapho_prefetch_text": "While the processor executes the current instruction, it also fetches the next instruction from the program memory (ROM) (1st pipeline stage). It separates the opcode from the operand, which are concatenated in the ROM, and controls the instruction decoder and the program counter.",
        "sapho_decoder_text": "Instruction Decoder",
        "sapho_register_text": "Register File",
        "sapho_register": "The Register File is created whenever arrays are used in the user's program. Its function is to correctly index the elements of the array, offsetting the memory position of the first element to access the desired element's position.",
        "sapho_alu": "Arithmetic Logic Unit (ALU)",
        "sapho_alu_text": "The ALU of this soft-core processor offers a significant degree of automated parameterization flexibility. As a result, the processor's structure can be modified to suit its intended purpose. The ALU is automatically parameterized by the assembly compiler based on the instructions produced by the C+− compiler, in addition to parameters selected by the user at design time, such as fixed-point or floating-point arithmetic and the bit size of the word. The circuits created automatically by the assembler can be found in Table 2. The third column indicates which circuits are created within the ALU, while the others are created externally. The following columns show which circuits are created for fixed-point or floating-point processors.",
        "sapho_table_instruction": "Instruction",
        "sapho_table_circuit": "Circuit",
        "sapho_table_alu": "ALU",
        "sapho_table_fixed_point": "Fixed Point",
        "sapho_table_floating_point": "Floating Point",
        "sapho_table_division": "Division",
        "sapho_table_bitwise_or": "Bitwise OR",
        "sapho_table_greater": "Greater than",
        "sapho_table_mod": "Modulo",
        "sapho_table_less": "Less than",
        "sapho_table_equal": "Equal to",
        "sapho_table_bitwise_and": "Bitwise AND",
        "sapho_table_logical_and": "Logical AND",
        "sapho_table_bitwise_not": "Bitwise NOT",
        "sapho_table_logical_not": "Logical NOT",
        "sapho_table_shift_r": "Shift Right",
        "sapho_table_shift_l": "Shift Left",
        "sapho_table_arithmetic": "Arithmetic Shift",
        "sapho_table_stack": "Stack Pointer",
        "sapho_table_indirect": "Indirect Addressing",
        "sapho_table_note": "Table: Instructions and respective circuits created automatically.",
        "sapho_software_overview": "Software Overview of SAPHO",
        "sapho_software_conversion": "This streamlined approach allows developers to efficiently convert high-level C+− code into a low-level hardware description suitable for FPGA implementation, optimizing the process of hardware design and ensuring that the necessary memory structures are in place for the intended application.",
        "sapho_ide_title": "Integrated Development Environment (IDE) Overview",
        "sapho_ide_subtitle": "The SAPHO processor's IDE, developed in C#, provides essential features for parameterization and compiler invocation. The main interface includes five key areas:",
        "sapho_ide_menu_title": "Menu Bar:",
        "sapho_ide_menu": "offers options for creating new projects, managing the current project, or exiting the application.",
        "sapho_ide_toolbar_title": "Toolbar:",
        "sapho_ide_toolbar": "located below the menu bar, it features quick-access icons for adding new processors and invoking the C+− and Assembly compilers.",
        "sapho_ide_tree_title": "Project Hierarchy Tree:",
        "sapho_ide_tree": "displays all processors within the project and allows access to C+− and assembly files for each processor.",
        "sapho_ide_window_title": "Programming Window:",
        "sapho_ide_window": "enables users to write and view code in C+− and Assembly, organized through open tabs.",
        "sapho_ide_console_title": "Console Window:",
        "sapho_ide_console": "displays compilation messages, including errors and warnings, and shows the number of instructions and variables after successful compilation.",
        "sapho_project_title": "Creating a New Project",
        "sapho_project_subtitle": "Upon opening the IDE, users must create a new project by navigating to File > New Project, where they can name the project and select a directory (avoiding spaces or special characters). Once created, the project appears in the hierarchy tree, and options for adding processors become available.",
        "sapho_project_ide_title": "Adding a Processor in the IDE",
        "sapho_project_ide_subtitle": "After creating a project, users can add a processor by clicking the enabled button, which opens the processor configuration screen. This screen includes four main configuration fields.",
        "sapho_project_general_title": "General Settings:",
        "sapho_project_general_before": "users provide a name for the processor, which will also be used for the generated",
        "sapho_project_general_inter_after": "and",
        "sapho_project_general_after": "files.",
        "sapho_project_alu_title": "ALU Settings:",
        "sapho_project_alu": "users can choose the number of bits for fixed-point representation or specify the number of bits for the mantissa and exponent in floating-point representation.",
        "sapho_project_memory_title": "Memory Stack Settings:",
        "sapho_project_memory": "the sizes of the Data and Instruction stacks are defined here if they are utilized.",
        "sapho_project_io_title": "Input/Output Settings",
        "sapho_project_io": "users establish the number of input and output addresses.",
        "sapho_project_config_before": "All configuration parameters are automatically written as compilation directives at the beginning of the",
        "sapho_project_config_after": "file, serving as a header and influencing the hardware resources used.",
        "sapho_project_data_mif_before": "Upon completing the compilation process (C+− followed by Assembly), two memory initialization files",
        "sapho_project_data_mif_inter": "and",
        "sapho_project_data_mif_after": "are created, containing the contents of the data and program memories, respectively. Additionally, a Verilog file is generated, encapsulating the parameters specified in the SAPHO IDE for hardware instantiation.",
        "sapho_project_figure_title": "Figures illustrate the processor configuration screen, the project folder structure, and a flowchart detailing the project creation process in SAPHO.",
        "sapho_project_folder_image": "Image: folder structure of a project in SAPHO (3).",
        "sapho_project_flow_image": "Image: flowchart of the process of creating a project in SAPHO (4).",
        "sapho_compilers_title": "Compilers",
        "sapho_c_compiler_title": "C Compiler",
        "sapho_sps_title": "Single-file Program Structure:",
        "sapho_sps": "the program must be contained in one file and supports subroutines, enabling automatic instruction stack creation for function returns and recursive algorithms.",
        "sapho_compiler_pointer_title": "Pointer Limitations:",
        "sapho_compiler_pointer": "pointers are restricted to indexing fixed-size one-dimensional arrays to facilitate prior memory size calculation.",
        "sapho_compiler_memory_title": "No Dynamic Memory Allocation:",
        "sapho_compiler_memory": "this restriction ensures efficient hardware resource utilization. When arrays are declared, the compiler generates necessary indirect addressing circuits.",
        "sapho_functions_title": "Supported functions, keywords, and operators are summarized in a table, showcasing the capabilities of the C compiler.",
        "sapho_table_category_title": "Category",
        "table_content_title": "Content",
        "sapho_table_keywords": "Keywords",
        "sapho_table_operators": "Operators",
        "sapho_asm_compiler_subtitle": "The assembler compiler features 49 instructions and generates the Verilog file that describes the processor's hardware, alongside initialization files for the associated memories. Built with GNU Flex, it effectively recognizes opcodes and operands. Key capabilities include.",
        "sapho_asm_variable_title": "Instruction and Variable Recognition:",
        "sapho_asm_variable": "it assesses the total number of program instructions and required variables to allocate the correct size for both program and data memory.",
        "sapho_asm_fpf_title": "Proposed Floating-Point Format",
        "sapho_asm_i3e_before": "In digital circuits, floating-point numbers are typically represented according to the",
        "sapho_asm_i3e_after": "standard, using 32 bits for single precision and 64 bits for double precision. This standard includes special number representations and defines arithmetic operations.",
        "sapho_asm_mantissa": "This approach allows for a flexible range of mantissa and exponent values, optimizing the processor's performance in handling floating-point arithmetic.",
        "sapho_media_resources_note": "For more detailed insights into SAPHO, watch the videos above or explore additional articles and resources below.",
        "sapho_references_title": "References",
        "sapho_references_subtitle": "This section includes resources on processor architecture, advancements in fast computation, and research articles for in-depth study.",
        "sapho_references_intel": "Intel Research - Processor and Architecture",
        "sapho_references_arm": "ARM - Processor Architecture",
        "sapho_references_nature": "Nature - Quantum Computing Breakthroughs",
        "sapho_references_acm": "ACM Journal on Computing Architectures",
        "sapho_references_i3e": "IEEE - Computer Architecture",
        "sapho_references_fct": "ACM - Fast Computation Techniques",
        "sapho_references_hpc": "HPC Wire - High-Performance Computing",
        "sapho_references_wiki": "Wikipedia - Instruction Set Architecture",
        "sapho_licensed": "Licensed under",
        
        "sapho_download_title": "SAPHO Download | NIPSCERN Lab",
        "sapho_download_text_subtitle": "Scalable Architecture Processor for Hardware Optimization.",
        "sapho_download_documentation": "Go to Documentation",
        "sapho_download_back": "Back to Main Page",
        "sapho_download_thanks": "Thank you for downloading SAPHO!"
        
    },
    "pt": {
        "home_title": "NIPSCERN - Pesquisa e Inovação | Laboratório NIPSCERN",
        "home_btn_search": "Pesquisar",
        "home_welcome": "Bem-vindo ao NIPSCERN",
        "home_current_research": "Pesquisa atual",
        "home_supporters": "Apoiadores",
        "home_about_us": "Sobre nós",
        "home_faq": "Perguntas frequentes",
        "home_contact_us": "Entre em contato",
        "home_title_text": "A fusão do processamento de sinais e da pesquisa de partículas",
        "home_subtitle_text": "Colaborando globalmente para expandir os limites da física, tecnologia e inovação.",
        "home_btn_learn_more": "Saiba mais",
        "home_btn_explore_projects": "Explore projetos",
        "home_sapho_card": "Processadores de programas em C+- com SAPHO: Arquitetura escalável Processador para otimização de hardware.",
        "home_read_more": "Leia mais",
        "home_aura_card": "Um IDE moderno, funcional e bonito com IA incorporada para programar processadores usando a linguagem C+.",
        "home_alice_card": "Uma nova maneira otimizada de traduzir código C+ para Assembly. Rápido e confiável.",
        "home_helvetia_card": "Toda a documentação do NIPSCERN Lab. Encontre instruções, dicas, exemplos e muito mais.",
        "home_infinity_card": "Aplicativo tudo-em-um que economiza seu tempo após formatar seu Windows. Baixe ferramentas úteis.",
        "home_cern_card": "Saiba mais sobre o CERN, a Organização Europeia para Pesquisa Nuclear.",
        "home_text_about_us": "O NIPSCERN está na vanguarda da inovação nas áreas de processamento de sinais e pesquisa de partículas, impulsionando avanços que remodelam nossa compreensão do universo.",
        "home_title_our_mission": "Nossa Missão",
        "home_text_our_mission": "Aproveitar tecnologias de ponta e pesquisa colaborativa para avançar o conhecimento e resolver desafios complexos na ciência.",
        "home_title_our_vision": "Nossa Visão",
        "home_text_our_vision": "Ser um líder global em pesquisa e inovação, inspirando gerações futuras a explorar as fronteiras da ciência.",
        "home_title_join_us": "Junte-se a nós em nossa jornada!",
        "home_text_join_us": "Juntos, podemos desbloquear novos potenciais em pesquisa e tecnologia. Explore nossos projetos ou envolva-se!",
        "home_title_faq": "Perguntas frequentes",
        "home_text_faq_q_1": "Onde fica o NIPSCERN Lab?",
        "home_text_faq_a_1": "O NIPSCERN Lab fica na Universidade Federal de Juiz de Fora, no estado de Minas Gerais, Brasil.",
        "home_text_faq_q_2": "Quais projetos o NIPSCERN desenvolveu?",
        "home_text_faq_a_2": "Desenvolvemos uma variedade de projetos como AURA IDE, SAPHO, Infinity Manager e muito mais.",
        "home_text_faq_q_3": "Como posso ajudar o laboratório?",
        "home_text_faq_a_3": "Você pode se juntar a nós em nosso GitHub localizado no rodapé.",
        "home_title_get_touch": "Entre em contato",
        "home_text_send_message": "Enviar mensagem",
        "home_text_contact_info": "Informações de contato",
        "home_privacy_policy": "Política de privacidade",
        "home_terms_service": "Termos de serviço",
        "home_footer_license": "Este trabalho está licenciado sob uma",
        
        
        "cern_title": "História do CERN e Projeto ATLAS | Laboratório NIPSCERN",
        "cern_nav_history": "História do CERN",
        "cern_nav_atlas": "Projeto ATLAS",
        "cern_nav_media": "Mídia e Recursos",
        "cern_nav_references": "Referências",
        "cern_header_text": "História do CERN e Projeto ATLAS",
        "cern_subtitle": "Entendendo o universo por meio da física de partículas.",
        "cern_intro_text": "História do CERN",
        "cern_intro_cern": "O CERN, a Organização Europeia para Pesquisa Nuclear, foi fundada em 1954 por 12 países europeus em um esforço para estabelecer uma instalação de pesquisa de classe mundial para explorar os mistérios do universo. Hoje, é um dos maiores e mais respeitados centros de pesquisa científica do mundo, com 23 estados-membros e inúmeras parcerias globais. O CERN está localizado principalmente em Genebra, Suíça, com suas instalações abrangendo a fronteira franco-suíça.",
        "cern_intro_mission": "A missão do CERN é fornecer aos físicos as ferramentas e a infraestrutura necessárias para conduzir experimentos inovadores em pesquisa de partículas subatômicas, avançando nossa compreensão do universo. A organização tem estado na vanguarda de várias conquistas científicas monumentais.",
        "cern_section_location_title": "Localização",
        "cern_section_location": "O campus principal do CERN está localizado na fronteira franco-suíça, perto de Genebra, Suíça. O Large Hadron Collider (LHC), o mais famoso de seus aceleradores de partículas, corre no subsolo em um túnel circular que abrange 27 quilômetros (17 milhas), com partes dele na Suíça e na França.",
        "cern_section_image_lhc": "Imagem: localização subterrânea do LHC e os quatro principais experimentos.",
        "cern_section_achievements_title": "Conquistas",
        "cern_section_achievements": "O CERN contribuiu significativamente para a física de partículas, não apenas por meio de descobertas, mas também pelo desenvolvimento de tecnologias que impactam a sociedade em geral. Uma das conquistas mais notáveis do CERN é a construção do Large Hadron Collider (LHC), o maior e mais poderoso acelerador de partículas do mundo, localizado a 100 metros de profundidade. O LHC permitiu que cientistas conduzissem experimentos que expandiram nossa compreensão da física de partículas e das forças que governam o universo.",
        "cern_section_image_ccc": "Imagem: centro de controle de aceleradores (CCC) do CERN, onde cientistas monitoram e controlam a operação do Grande Colisor de Hádrons e outros aceleradores no laboratório.",
        "cern_section_milestones_title": "Principais marcos",
        "cern_milestone_1954": "O CERN é fundado por 12 países europeus.",
        "cern_milestone_1989": "Tim Berners-Lee inventa a World Wide Web no CERN para atender à demanda por compartilhamento de informações entre físicos que trabalham em diferentes partes do mundo.",
        "cern_milestone_2008": "o Grande Colisor de Hádrons (LHC), o acelerador de partículas mais poderoso do mundo, começa a operar.",
        "cern_milestone_2012": "descoberta da partícula bóson de Higgs, um marco na física de partículas que confirma a existência do campo de Higgs, um elemento-chave no Modelo Padrão da física de partículas.",
         "cern_section_image_structure": "Imagem: um diagrama mostrando a estrutura organizacional do CERN, destacando seus vários departamentos e colaborações.",
        "cern_section_discoveries_title": "Descobertas e experimentos importantes",
        "cern_discovery_intro": "As descobertas do CERN revolucionaram nossa compreensão da física de partículas. Aqui estão alguns dos experimentos e descobertas mais importantes:",
        "cern_discovery_higgs_title": "A descoberta do bóson de Higgs (2012):",
        "cern_discovery_higgs": "um dos experimentos mais famosos conduzidos no CERN foi a busca pelo bóson de Higgs. Essa partícula elusiva foi teorizada para dar massa a outras partículas. Após décadas de pesquisa, o bóson de Higgs foi finalmente detectado em 2012 pelos detectores ATLAS e CMS no LHC. Essa descoberta rendeu aos cientistas François Englert e Peter Higgs o Prêmio Nobel de Física em 2013.",
        "cern_discovery_web_title": "A World Wide Web (1989):",
        "cern_discovery_web": "Tim Berners-Lee, um cientista britânico que trabalha no CERN, inventou a World Wide Web como um meio para pesquisadores do mundo todo compartilharem e acessarem dados. Desde então, essa invenção transformou a comunicação, o comércio e a conectividade global.",
        "cern_discovery_antimatter_title": "Experimentos de antimatéria:",
        "cern_discovery_antimatter": "O CERN também é conhecido por suas pesquisas sobre antimatéria. Em 1995, os cientistas do CERN criaram os primeiros átomos de anti-hidrogênio. Entender a antimatéria pode levar a avanços em campos que vão da energia à tecnologia médica.",
        "cern_discovery_quark_gluon_title": "Plasma de quarks e glúons:",
        "cern_discovery_quark_gluon": "O experimento ALICE do CERN foi fundamental no estudo do plasma de quarks e glúons, um estado da matéria que se acredita ter existido logo após o Big Bang. Ao colidir íons pesados em energias extremas, cientistas do CERN recriam condições semelhantes às do nascimento do universo.",
        "cern_section_curiosities_title": "Curiosidades sobre o CERN",
        "cern_curiosity_data_title": "Processamento de dados:",
        "cern_curiosity_data": "O CERN gera enormes quantidades de dados, aproximadamente 30 petabytes (30 milhões de gigabytes) anualmente, que são processados por uma rede global de centros de computação.",
        "cern_curiosity_detector_title": "O Detector Atlas:",
        "cern_curiosity_detector": "o detector ATLAS do CERN tem 45 metros de comprimento, 25 metros de diâmetro e pesa tanto quanto a Torre Eiffel!",
        "cern_curiosity_collaboration_title": "Colaboração internacional:",
        "cern_curiosity_collaboration": "O CERN emprega cientistas de mais de 100 países diferentes nacionalidades, promovendo um ambiente global para o progresso científico.",
        "cern_curiosity_black_holes_title": "Teorias dos buracos negros:",
        "cern_curiosity_black_holes": "alguns experimentos no CERN levaram à especulação sobre o potencial de criar micro buracos negros, embora não haja risco para a Terra, pois esses buracos negros evaporariam quase instantaneamente.",
        "cern_atlas_title": "Projeto ATLAS",
        "cern_atlas_experiment": "O experimento ATLAS no CERN é um dos maiores e mais complexos experimentos já construídos em física de partículas. É um detector de partículas de uso geral no Grande Colisor de Hádrons (LHC), projetado para explorar as partículas e forças fundamentais que compõem o universo. Com a colaboração de milhares de cientistas de todo o mundo, o ATLAS está ajudando a responder algumas das maiores questões da física.",
        "cern_atlas_discovery": "O ATLAS foi fundamental na descoberta do bóson de Higgs em 2012, uma descoberta inovadora que confirmou a existência do campo de Higgs, um componente-chave do Modelo Padrão da física de partículas. Além do bóson de Higgs, o ATLAS visa detectar uma ampla variedade de fenômenos, como dimensões extras, supersimetria e partículas que podem explicar a misteriosa matéria escura que compõe grande parte do universo.",
        "cern_atlas_location": "Localizado a 100 metros abaixo do solo, o detector ATLAS tem 46 metros de comprimento, 25 metros de diâmetro e pesa cerca de 7.000 toneladas. Seu vasto tamanho permite capturar uma ampla gama de interações de partículas, fornecendo aos pesquisadores dados inestimáveis para entender melhor o mundo subatômico.",
        "cern_atlas_nipscern_title": "Contribuição do NIPSCERN para o ATLAS",
        "cern_atlas_nipscern": "O Laboratório NIPSCERN está ativamente envolvido no projeto ATLAS. Pesquisadores do laboratório contribuem para a análise das enormes quantidades de dados gerados pelas colisões de partículas no LHC. Usando ferramentas e algoritmos computacionais avançados, os cientistas do NIPSCERN ajudam a processar e interpretar os dados, o que é essencial para identificar interações raras e significativas de partículas.",
        "cern_atlas_experiment_image": "Imagem: uma visão do imenso detector de partículas do experimento ATLAS durante a construção no CERN. O detector tem 46 metros de comprimento e é responsável por capturar dados de colisões de partículas de alta energia no LHC.",
        "cern_atlas_goal_title": "Objetivos do Projeto ATLAS",
        "cern_atlas_study_title": "Estude o Bóson de Higgs:",
        "cern_atlas_study": "após a descoberta do bóson de Higgs, o ATLAS continua a estudar suas propriedades em mais detalhes para entender melhor como as partículas adquirem massa.",
        "cern_atlas_search_title": "Busca por Matéria Escura:",
        "cern_atlas_search": "um dos objetivos mais ambiciosos do ATLAS é descobrir partículas que possam explicar a matéria escura, uma forma invisível de matéria que compõe cerca de 27% do universo.",
        "cern_atlas_susy_title": "Investigar a Supersimetria (SUSY):",
        "cern_atlas_susy": "O ATLAS busca evidências de supersimetria, uma teoria que estende o Modelo Padrão ao prever a existência de partículas parceiras para cada partícula conhecida, o que pode ajudar a resolver mistérios como a matéria escura e unificar forças.",
        "cern_atlas_string_title": "Explorar Dimensões Extras:",
        "cern_atlas_string": "o experimento procura sinais de dimensões espaciais extras, que teorias como a teoria das cordas sugerem que podem existem além das três dimensões espaciais que percebemos.",
        "cern_discovery_title": "Descobertas e áreas de pesquisa significativas",
        "cern_discovery_subtitle": "Além do bóson de Higgs, o ATLAS produziu insights significativos em muitas áreas da física de partículas. Aqui estão algumas contribuições notáveis:",
        "cern_measurement_title": "Medições de precisão:",
        "cern_measurement": "O ATLAS fez medições precisas dos processos do Modelo Padrão, como a produção de bósons W e Z, que ajudam a refinar nossa compreensão das forças fundamentais.",
        "cern_quark_title": "Principais estudos sobre quarks:",
        "cern_quark": "O ATLAS forneceu dados importantes sobre o quark top, a partícula elementar mais pesada conhecida, que desempenha um papel crucial no teste do Modelo Padrão.",
        "cern_model_title": "Nova física além do modelo padrão:",
        "cern_model": "O ATLAS continua a explorar novas partículas e forças potenciais além do Modelo Padrão, como partículas hipotéticas relacionadas à matéria escura ou formas exóticas de matéria, como plasma de quarks e glúons.",
        "cern_discovery_image": "Imagem: O ATLAS fornece a primeira medição da largura do bóson W no LHC.",
        "cern_facts_title": "Fatos interessantes sobre o ATLAS",
        "cern_scale_title": "Escala de colaboração:",
        "cern_scale": "O ATLAS envolve cerca de 3.000 cientistas de mais de 180 instituições em 38 países, tornando-o um dos projetos científicos mais colaborativos da história.",
        "cern_data_title": "Volume de dados:",
        "cern_data": "o experimento ATLAS produz uma quantidade enorme de dados – mais de 10 petabytes por ano, exigindo redes de computação avançadas em todo o mundo para processar as informações.",
        "cern_detector_title": "Complexidade do detector:",
        "cern_detector": "O ATLAS é composto de várias camadas de diferentes tipos de detectores que medem várias propriedades de partículas, incluindo seus caminhos, energia e momento.",
        "cern_media_resources": "Mídia e recursos",
        "cern_media_resources_subtitle": "Para insights mais detalhados sobre Trabalho do CERN, assista aos vídeos acima ou explore artigos e recursos adicionais abaixo.",
        "cern_media_references": "Referências",
        "cern_media_references_title": "Esta página inclui informações de uma variedade de fontes, oferecendo insights detalhados e recursos fáceis de entender sobre o CERN e o projeto ATLAS:",
        "cern_media_references_cern": "Site oficial do CERN",
        "cern_media_references_atlas": "Visão geral do experimento ATLAS",
        "cern_media_references_wiki": "Wikipedia - CERN",
        "cern_media_references_nature": "Artigo da Nature sobre a descoberta do Higgs",
        "cern_media_references_wiki_atlas": "Wikipedia - Experimento ATLAS",
        "cern_media_references_higgs": "Servidor de documentos do CERN - Artigo sobre a descoberta do bóson de Higgs",
        "cern_media_references_model": "CERN - Modelo padrão de física de partículas",
        "cern_media_references_matter": "Natureza - A Caçada pela Matéria Escura",
        "cern_media_references_exp": "Visão Geral dos Experimentos do CERN",
        "cern_media_references_magazine": "Revista CERN Courier",
        "cern_license": "Licenciado sob",

        
        "alice_title": "ALICE - Instruções lógicas de montagem para C+- Engine | NIPSCERN Lab",
        "alice_overview": "Visão geral",
        "alice_compiler_flow": "Fluxo de compilação",
        "alice_video_diagram": "Vídeo e diagrama",
        "alice_documentation": "Documentação",
        "alice_title_text": "*ALICE: Instruções lógicas de montagem para C+- Engine",
        "alice_subtitle_text": "Um inovador mecanismo de montagem otimizado para código C+-, transformando lógica complexa em instruções otimizadas para processadores escaláveis.",
        "alice_documentation_text": "Ir para documentação",
        "alice_compiler_flow_text": "Fluxo de compilação",
        "alice_input": "Seu arquivo de código C+- de origem, o ponto inicial do processo de compilação.",
        "alice_token": "Decompõe o arquivo de entrada em tokens (palavras-chave, identificadores, etc.).",
        "alice_parser": "Analisa sequências de tokens com base em regras gramaticais para criar a árvore de sintaxe.",
        "alice_ast_construction_title": "Construção AST:",
        "alice_ast_construction": "Gera a Árvore de Sintaxe Abstrata (AST) que representa a estrutura do programa.",
        "alice_lexical_analysis_title": "Análise Lexical Gerada:",
        "alice_lexical_analysis": "A saída do analisador léxico com base nos tokens.",
        "alice_parsing_title": "Análise Gerada:",
        "alice_parsing": "Lógica de análise gerada, derivada das regras gramaticais.",
        "alice_handling_title": "Manipulação de Inclusão:",
        "alice_handling": "Manipula todas as inclusões de arquivo especificadas no código-fonte.",
        "alice_output": "Saída:",
        "alice_output_title": "Código de montagem final, pronto para ser executado no processador.",
        "alice_flow_comp_title": "A compilação transforma",
        "alice_flow_comp_inter": "em",
        "alice_flow_comp_final": "por essas etapas sequenciais.",
        "alice_flow_input_file": "Este é o arquivo de entrada.",
        "alice_flow_exe": "Que vai diretamente para myccompiler.exe",
        "alice_token_process": "Aqui, o compilador começa a tokenizar o fluxo de texto de test.cmm.",
        "alice_token_generated": "Tokens:",
        "alice_token_stream": "Em seguida, o compilador *ALICE verifica se o fluxo de entrada de tokens é válido de acordo com a gramática.",
        "alice_nodes": "Vários nós são criados pela função 'create_node'. Neste exemplo, cinco produções/reduções são feitas:",
        "alice_asm_output": "Finalmente, o compilador *ALICE gera o código de saída ASM com base nos nós criados pela função create_node na etapa anterior.",
        "alice_nodes_title": "Nós:",
        "alice_asm_output_text": "Este é o arquivo de saída.",
        "alice_video_example_title": "Vídeo de exemplo",
        "alice_diagram_flow_title": "Diagrama de fluxo de compilação",
        "alice_diagram_flow_button": "Mostrar diagrama",
        "alice_features_title": "Recursos",
        "alice_fast_compilation_title": "Compilação rápida",
        "alice_fast_compilation": "*ALICE compila código C+- de forma rápida e eficiente para desempenho otimizado.",
        "alice_multi_file_title": "Suporte a vários arquivos",
        "alice_multi_file": "Compile vários arquivos de uma vez com rastreamento preciso de erros por linha.",
        "alice_stack_size_title": "Tamanho de pilha personalizado",
        "alice_stack-size": "Tamanho de pilha ajustável para processamento mais rápido e otimização de hardware.",
        "alice_processor_title": "Escolha do processador",
         "alice_processor": "Selecione entre tipos de processador de ponto fixo ou ponto flutuante.",
        "alice_directive_title": "Gerenciamento de diretivas",
        "alice_directive": "Suporta uma ampla gama de diretivas com parâmetros personalizáveis.",
        "alice_future_features": "Recursos futuros",
        "alice_enhanced_error_title": "Relatório de erros aprimorado",
        "alice_enhanced_error": "Relatórios de erros e avisos mais detalhados.",
        "alice_performance_optm_title": "Otimização de desempenho",
        "alice_performance_optm": "Dicas de compilação mais rápida e otimização de código integrada.",
        "alice_plugin_title": "Sistema de plugins",
        "alice_plugin": "Suporte para complementos e ferramentas criadas pela comunidade.",
        "alice_stonks_title": "Insights estatísticos",
        "alice_stonks": "Sugestões baseadas em dados para melhorias de código.",
        "alice_security_title": "Melhorias de segurança",
        "alice_security": "Recursos de confiabilidade e segurança aprimorados.",
        "alice_alice_documentation_title": "Documentação ALICE",
        "alice_alice_documentation": "Encontre informações detalhadas e guias sobre a Instrução Lógica de Montagem ALICE para C Engine.",
        "alice_alice_documentation_button": "Ler documentação",
        "alice_alice_license": "Licenciado sob",
        
        "infinity_title": "Infinity Manager | NIPSCERN Lab",
        "infinity_initial_title": "Infinity",
        "infinity_final_title": "Gerenciador",
        "infinity_subtitle": "Gerenciador de downloads para ferramentas do NIPSCERN Lab",
        "infinity_welcome_title": "Bem-vindo ao Infinity Manager, o gerenciador de downloads dedicado ao NIPSCERN Lab. Projetado com pesquisadores e desenvolvedores em mente, o Infinity Manager simplifica o processo de acesso a ferramentas de software essenciais necessárias para projetos inovadores nas áreas de processamento de sinais e pesquisa computacional.",
        "infinity_summary_1": "O objetivo principal do Infinity Manager é agilizar a instalação e o gerenciamento de software para usuários do NIPSCERN Lab. Ao fornecer uma plataforma centralizada para baixar, instalar e atualizar vários aplicativos de software, o Infinity Manager aumenta a produtividade e garante que todos os usuários tenham acesso fácil às ferramentas mais recentes necessárias para seu trabalho.",
        "infinity_summary_2": "O Infinity Manager também promove a colaboração dentro do laboratório, permitindo fácil compartilhamento e distribuição de software entre os membros da equipe. Com uma interface de usuário intuitiva e documentação abrangente, os usuários podem navegar sem esforço pelas opções de software disponíveis, garantindo que tenham as ferramentas certas na ponta dos dedos para a conclusão bem-sucedida do projeto.",
        "infinity_available_software_title": "Software disponível:",
        "infinity_available_software": "e mais em breve.",
        "infinity_future_software": "Disponibilidade futura de software: No Infinity Manager, estamos comprometidos em expandir continuamente nossas ofertas de software para garantir que você tenha acesso às ferramentas mais eficazes para suas necessidades de desenvolvimento e produtividade. No futuro, pretendemos incluir ainda mais programas que atendam a vários aspectos do desenvolvimento de software, análise de dados, design e colaboração. Fique ligado para atualizações sobre novas adições que irão aprimorar ainda mais seu fluxo de trabalho e dar suporte aos seus projetos no NIPSCERN Lab.",
        "infinity_open_source": "Importância do software de código aberto: o software de código aberto desempenha um papel vital no cenário tecnológico atual. Ao fornecer acesso ao código-fonte, ele incentiva a transparência, a colaboração e a inovação. Os programas de código aberto capacitam os desenvolvedores a modificar e melhorar o software de acordo com suas necessidades exclusivas, promovendo uma abordagem orientada pela comunidade para a resolução de problemas.",
        "infinity_do_more": "Explore, contribua e inove: à medida que construímos a plataforma Infinity Manager, convidamos você a explorar as ofertas atuais e fornecer feedback sobre quais ferramentas você considera mais valiosas. Juntos, podemos criar um recurso que não apenas atenda às suas necessidades, mas também contribua para o próspero ecossistema de código aberto.",
        "infinity_thanks": "Obrigado por escolher o Infinity Manager — seu portal para soluções de software essenciais para o NIPSCERN Lab.",
        "infinity_find_us": "Encontre-nos",
        "infinity_learn_more": "Saiba mais",
        "infinity_learn_more_cern": "Sobre o CERN",
        "infinity_visit": "Visite",
        "infinity_visit_cnpq_ufjf": "CNPq e UFJF",
        "infinity_licensed": "O NIPSCERN é licenciado sob CC BY-NC-SA 4.0",
        
        "privacy_title": "Política de Privacidade | NIPSCERN Lab",
        "privacy_policy_title": "Política de Privacidade",
        "privacy_last_updated": "Última atualização: 10.09.2024",
        "privacy_subtitle": "No NIPSCERN Lab, respeitamos sua privacidade e estamos comprometidos em manter a transparência. Não coletamos, armazenamos ou processamos nenhum dado pessoal de nossos usuários.",
        "privacy_data_collection_title": "1. Coleta de Dados",
        "privacy_data_collection": "O NIPSCERN Lab não coleta nenhuma informação pessoal de visitantes ou usuários. Não usamos cookies, mecanismos de rastreamento ou ferramentas analíticas que coletam dados pessoais.",
        "privacy_third_party_title": "2. Links de Terceiros",
        "privacy_third_party": "Nosso site pode conter links para sites de terceiros, incluindo nossos parceiros como CNPq, UFJF e CERN. Nós o encorajamos a revise suas políticas de privacidade antes de se envolver com elas.",
        "privacy_open_source_title": "3. Filosofia de código aberto",
        "privacy_open_source": "Todos os projetos desenvolvidos no NIPSCERN Lab são de código aberto. Não rastreamos ou monitoramos quem acessa ou baixa nosso software.",
        "privacy_rights_title": "4. Seus direitos",
        "privacy_rights": "Como não coletamos nenhum dado, não há direitos do usuário relacionados a informações pessoais em nossos sistemas.",
        "privacy_contact_title": "5. Informações de contato",
        "privacy_contact": "Para quaisquer perguntas sobre esta política de privacidade, entre em contato conosco em contact@nipscern.com.",
        "privacy_back": "Voltar para a página principal",

        "service_title": "Termos de serviço | NIPSCERN Lab",
        "service_terms_service_title": "Termos de Serviço",
        "service_last_updated": "Última atualização: 10.09.2024",
        "service_welcome": "Bem-vindo ao NIPSCERN Lab! Nossa missão é construir projetos de código aberto de alta qualidade. Ao acessar ou usar nosso site, você concorda com estes Termos de Serviço.",
        "service_acceptance_terms": "1. Aceitação dos Termos",
        "service_acceptance_text": "Ao acessar e usar o site ou os projetos do NIPSCERN Lab, você concorda em cumprir e estar vinculado a estes termos.",
        "service_open_source_projects": "2. Uso de Projetos de Código Aberto",
        "service_open_source_text": "Todos os projetos desenvolvidos pelo NIPSCERN Lab são de código aberto e estão disponíveis para uso sob licenças de código aberto relevantes.",
        "service_disclaimer_warranties": "3. Isenção de Garantias",
        "service_disclaimer_text": "O NIPSCERN Lab fornece seu site, projetos e software \"como estão\". Não garantimos a confiabilidade ou funcionalidade do software que lançamos.",
        "service_collaborations": "4. Colaborações",
        "service_collaborations_text": "Temos orgulho de colaborar com o CNPq, UFJF e CERN. No entanto, o NIPSCERN Lab opera de forma independente e não é responsável pelas políticas ou práticas dessas organizações.",
        "service_limitation_liability": "5. Limitação de Responsabilidade",
        "service_limitation_text": "O NIPSCERN Lab não será responsável por quaisquer danos resultantes do uso ou da incapacidade de usar nosso software ou site.",
        "service_changes_terms": "6. Alterações nos Termos",
        "service_changes_text": "Reservamo-nos o direito de atualizar estes termos. O uso contínuo do nosso site após as alterações terem sido feitas constitui aceitação dos termos revisados.",
        "service_contact_information": "7. Informações de contato",
        "service_contact_text": "Para quaisquer perguntas sobre estes Termos de Serviço, entre em contato conosco em contact@nipscern.com.",
        "service_back": "Voltar para a página principal",
        
        
        "sapho_title": "SAPHO - Processador de Arquitetura Escalável para Otimização de Hardware | NIPSCERN Lab",
        "sapho_nav_introduction": "Introdução",
        "sapho_nav_ide": "IDE",
        "sapho_nav_compiler": "Compiladores",
        "sapho_nav_media": "Mídia e Recursos",
        "sapho_nav_references": "Referências",
        "sapho_subtitle": "Processador de Arquitetura Escalável para Otimização de Hardware.",
        "sapho_documentation": "Ir para Documentação",
        "sapho_introduction_title": "SAPHO: uma Introdução",
        "sapho_introduction": "A arquitetura fixa dos Processador Soft Cores (PSCs) disponíveis atualmente é uma característica comum entre eles. Isso significa que a mesma quantidade de recursos de hardware é alocada independentemente do programa embarcado. Além disso, o tamanho da palavra é fixo e normalmente é superdimensionado. Este site apresenta uma processador soft-core escalável desenvolvido no Núcleo de Processamento de Sinais e Instrumentação da Faculdade de Engenharia da UFJF (Universidade Federal de Juiz de Fora).",
        "sapho_overview_title": "Visão geral do SAPHO",
        "sapho_overview_open-source": "O SAPHO, sigla para Scalable Architecture Processor for Hardware Optimization, é um processador soft-core de código aberto projetado para alocar automaticamente os recursos de hardware necessários durante o tempo de compilação de programas embarcados. Ele é usado principalmente em frameworks de processamento multi-core e foi implementado em vários sistemas estabelecidos.",
        "sapho_overview_compilers": "A funcionalidade do SAPHO é baseada em seus dois compiladores, acessíveis por meio de seu principal Ambiente de Desenvolvimento Integrado (IDE). O primeiro compilador, C+−, é responsável por interpretar programas escritos em um subconjunto da linguagem C e convertê-los para a linguagem Assembly. O segundo compilador pega o código Assembly gerado pelo primeiro compilador e o traduz em código de máquina, alocando os recursos de hardware necessários e gerando um arquivo de configuração em Verilog.",
        "sapho_overview_assembler": "O assembler primeiro identifica as instruções produzidas pelo programa escrito pelo usuário e então cria apenas os recursos de hardware necessários para a execução. A maioria das configurações, como o desenvolvimento de circuitos internos para a Unidade Lógica Aritmética (ALU), são automatizadas. Os programadores podem modificar recursos adicionais, incluindo tamanho de palavra, tipo de ALU (ponto fixo ou ponto flutuante) e o número de portas de entrada e saída, usando diretivas de compilação.",
        "sapho_overview_psc": "Uma distinção fundamental entre SAPHO e PSCs disponíveis está em sua capacidade de ajustar sua arquitetura com base no programa implementado. No entanto, ele perde a capacidade de atualizar o programa durante o tempo de execução. No entanto, em muitas aplicações atuais, as vantagens da otimização de recursos justificam essa limitação.",
        "sapho_description_title": "Descrição do SAPHO",
        "sapho_description_harvard": "O SAPHO é baseado em uma arquitetura Harvard e apresenta um design Reduced Instruction Set Computer (RISC), que permite determinar os recursos de hardware necessários com base na aplicação do usuário. A Arithmetic Logic Unit (ALU) dentro do SAPHO pode ser configurada para operações de ponto fixo e ponto flutuante, e seus sistemas de memória — dados e programa — apresentam endereços de autoescala.",
        "sapho_description_tools": "Além do processador em si, que inclui seu núcleo e duas unidades de memória, várias ferramentas foram desenvolvidas para facilitar a programação. Essas ferramentas incluem uma interface de desenvolvimento, um compilador que interpreta um subconjunto da linguagem C conhecido como C+− e um montador.",
        "sapho_advantages_title": "Algumas das vantagens de usar o processador SAPHO incluem:",
        "sapho_advantages_instruction_title": "Execução de uma única instrução por ciclo de clock:",
        "sapho_advantages_instruction": "ele pode executar uma instrução por ciclo de clock, mesmo em rotinas com saltos condicionais, sem interromper o pipeline, graças à sua arquitetura de pipeline de três estágios.",
        "sapho_advantages_alu_title": "ALU configurável:",
        "sapho_advantages_alu": "a ALU pode ser ajustada para tamanhos de palavras variáveis e pode manipular operações de ponto fixo e ponto flutuante.",
        "sapho_advantages_resource_title": "Alocação de recursos parametrizada:",
        "sapho_advantages_resource": "os recursos são alocados de forma parametrizada no momento do design, adaptados ao aplicativo específico desenvolvido.",
        "sapho_advantages_flexibility_title": "Flexibilidade de programação:",
        "sapho_advantages_flexibility": "os usuários podem programar o processador usando um subconjunto da linguagem C ou diretamente na linguagem Assembly.",
        "sapho_architecture_title": "Arquitetura de hardware do SAPHO",
        "sapho_architecture_blocks": "Os blocos primários da arquitetura SAPHO são ilustrados na Figura 1, onde as linhas sólidas indicam o fluxo de dados e as linhas tracejadas representam sinais de controle. Os blocos amarelo-claros são instanciados automaticamente sob demanda, dependendo do programa incorporado, enquanto os blocos azul-claros são sempre instanciados. Como ambas as unidades de memória são síncronas, os três estágios de pipeline requeridos pelo processador são descritos na Figura 2.",
        "sapho_architecture_data": "Ponteiros para a pilha de dados e pilha de instruções (Ponteiro de Pilha e Ponteiro de Instrução) gerenciam as operações de leitura e gravação em suas respectivas pilhas, que são compartilhadas entre as memórias de dados e programa. Na memória de dados, a pilha é usada para armazenamento temporário de dados via instruções PUSH e POP e suas variantes. Na memória do programa, a pilha permite o uso de sub-rotinas com instruções CALL e RETURN.",
        "sapho_architecture_circuits": "Quando a ALU é configurada para operações de ponto flutuante, os circuitos de transformação entre representações de ponto fixo e ponto flutuante são automaticamente instanciados nos barramentos de entrada e saída, permitindo que o processador se comunique com dispositivos de E/S usando números inteiros em notação de complemento de dois.",
        "sapho_architecture_block_image": "Imagem: Diagrama de blocos do processador SAPHO (1).",
        "sapho_architecture_pipeline_image": "Imagem: diagrama de estágios de pipeline executados pelo SAPHO (2).",
        "sapho_architecture_explanation": "Abaixo você pode ver uma explicação mais detalhada de cada bloco do processador mostrado na Figura 1.",
        "sapho_architecture_program": "Dados e memória de programa",
        "sapho_code": "Como mencionado anteriormente, os tamanhos dos dados e memórias de programa são determinados pelo código escrito. O compilador assembly calcula o número de endereços necessários para armazenar todas as instruções e variáveis do código do programa, parametrizando assim a instância das memórias. O assembler gera o conteúdo dessas memórias e salva em arquivos de inicialização de memória (com uma extensão .mif), que são instanciados no FPGA junto com o hardware do processador.",
        "sapho_program_counter": "Contador de Programa - PC",
        "sapho_program_counter_text": "Este bloco aponta para o local da instrução na memória a ser lida da memória do programa. Durante a execução normal do programa, ele é incrementado após cada instrução. Quando uma instrução de salto é detectada, ela é carregada com um valor específico que se refere à próxima instrução. O tamanho, em bits, do PC é definido pelo compilador assembly com base no tamanho da memória do programa.",
        "sapho_prefetch": "Pré-busca",
        "sapho_prefetch_text": "Enquanto o processador executa a instrução atual, ele também busca a próxima instrução da memória do programa (ROM) (1º estágio do pipeline). Ele separa o opcode do operando, que são concatenados na ROM, e controla o decodificador de instruções e o contador do programa.",
        "sapho_decoder_text": "Decodificador de instruções",
        "sapho_decoder": "O decodificador de instruções recebe o opcode, interpreta-o e envia os sinais de controle corretos, como aqueles para a operação ALU, habilitando a saída de dados, atribuindo valores no Register File quando matrizes são usadas, habilitando a gravação de dados na memória e enviando sinais PUSH e POP para o Stack Pointer, entre outros.",
        "sapho_register_text": "Arquivo de registro",
        "sapho_register": "O Register File é criado sempre que matrizes são usadas no programa do usuário. Sua função é indexar corretamente os elementos da matriz, deslocando a posição de memória do primeiro elemento para acessar a posição do elemento desejado.",
        "sapho_alu": "Unidade Lógica Aritmética (ULA)",
        "sapho_alu_text": "A ALU deste processador soft-core oferece um grau significativo de flexibilidade de parametrização automatizada. Como resultado, a estrutura do processador pode ser modificada para se adequar à sua finalidade pretendida. A ALU é parametrizada automaticamente pelo compilador assembly com base nas instruções produzidas pelo compilador C+−, além de parâmetros selecionados pelo usuário no momento do design, como aritmética de ponto fixo ou ponto flutuante e o tamanho de bit da palavra. Os circuitos criados automaticamente pelo assembler podem ser encontrados na Tabela 2. A terceira coluna indica quais circuitos são criados dentro da ALU, enquanto os outros são criados externamente. As colunas a seguir mostram quais circuitos são criados para processadores de ponto fixo ou ponto flutuante.",
        "sapho_table_instruction": "Instrução",
        "sapho_table_circuit": "Circuito",
        "sapho_table_alu": "ULA",
        "sapho_table_fixed_point": "Ponto Fixo",
        "sapho_table_floating_point": "Ponto Flutuante",
        "sapho_table_division": "Divisão",
        "sapho_table_bitwise_or": "OR bit a bit",
        "sapho_table_greater": "Maior que",
        "sapho_table_mod": "Módulo",
        "sapho_table_less": "Menor que than",
        "sapho_table_equal": "Igual a",
        "sapho_table_bitwise_and": "E bit a bit",
        "sapho_table_logical_and": "E lógico",
        "sapho_table_bitwise_not": "NÃO bit a bit",
        "sapho_table_logical_not": "NÃO lógico",
        "sapho_table_shift_r": "Deslocar para a direita",
        "sapho_table_shift_l": "Deslocar para a esquerda",
        "sapho_table_arithmetic": "Deslocamento aritmético",
        "sapho_table_stack": "Ponteiro de pilha",
        "sapho_table_indirect": "Endereçamento indireto",
        "sapho_table_note": "Tabela: Instruções e respectivos circuitos criados automaticamente.",
        "sapho_software_overview": "Visão geral do software SAPHO",
        "sapho_software_conversion": "Esta abordagem simplificada permite que os desenvolvedores converter código C+− de alto nível em uma descrição de hardware de baixo nível adequada para implementação de FPGA, otimizando o processo de design de hardware e garantindo que as estruturas de memória necessárias estejam em vigor para a aplicação pretendida.",
        "sapho_ide_title": "Visão geral do ambiente de desenvolvimento integrado (IDE)",
        "sapho_ide_subtitle": "O IDE do processador SAPHO, desenvolvido em C#, fornece recursos essenciais para parametrização e invocação do compilador. A interface principal inclui cinco áreas principais:",
        "sapho_ide_menu_title": "Barra de menus:",
        "sapho_ide_menu": "oferece opções para criar novos projetos, gerenciar o projeto atual ou sair do aplicativo.",
        "sapho_ide_toolbar_title": "Barra de ferramentas:",
        "sapho_ide_toolbar": "localizada abaixo da barra de menus, ela apresenta ícones de acesso rápido para adicionar novos processadores e invocar os compiladores C+− e Assembly.",
        "sapho_ide_tree_title": "Árvore de hierarquia do projeto:",
        "sapho_ide_tree": "exibe todos os processadores dentro do projeto e permite acesso aos arquivos C+− e assembly para cada processador.",
        "sapho_ide_window_title": "Janela de programação:",
        "sapho_ide_window": "permite que os usuários escrevam e visualizem código em C+− e Assembly, organizado por meio de guias abertas.",
        "sapho_ide_console_title": "Janela do console:",
        "sapho_ide_console": "exibe mensagens de compilação, incluindo erros e avisos, e mostra o número de instruções e variáveis após a compilação bem-sucedida.",
        "sapho_project_title": "Criando um novo projeto",
        "sapho_project_subtitle": "Ao abrir o IDE, os usuários devem criar um novo projeto navegando até Arquivo > Novo projeto, onde podem nomear o projeto e selecionar um diretório (evitando espaços ou caracteres especiais). Uma vez criado, o projeto aparece na árvore de hierarquia, e as opções para adicionar processadores ficam disponíveis.",
        "sapho_project_ide_title": "Adicionando um processador no IDE",
        "sapho_project_ide_subtitle": "Após criar um projeto, os usuários podem adicionar um processador clicando no botão habilitado, que abre a tela de configuração do processador. Esta tela inclui quatro campos de configuração principais.",
        "sapho_project_general_title": "Configurações gerais:",
        "sapho_project_general_before": "os usuários fornecem um nome para o processador, que também será usado para os",
        "sapho_project_general_inter_after": "e",
        "sapho_project_general_after": "arquivos.",
           "sapho_project_alu_title": "Configurações da ALU:",
        "sapho_project_alu": "os usuários podem escolher o número de bits para representação de ponto fixo ou especificar o número de bits para a mantissa e o expoente na representação de ponto flutuante.",
        "sapho_project_memory_title": "Configurações da pilha de memória:",
        "sapho_project_memory": "os tamanhos das pilhas de dados e instruções são definidos aqui se forem utilizados.",
        "sapho_project_io_title": "Configurações de entrada/saída",
        "sapho_project_io": "os usuários estabelecem o número de endereços de entrada e saída.",
        "sapho_project_config_before": "Todos os parâmetros de configuração são automaticamente escritos como diretivas de compilação no início do",
        "sapho_project_config_after": "arquivo, servindo como um cabeçalho e influenciando os recursos de hardware usados.",
        "sapho_project_data_mif_before": "Após concluir o processo de compilação (C+− seguido por Assembly), dois arquivos de inicialização de memória",
        "sapho_project_data_mif_inter": "e",
        "sapho_project_data_mif_after": "são criados, contendo o conteúdo dos dados e memórias do programa, respectivamente. Além disso, um arquivo Verilog é gerado, encapsulando os parâmetros especificados no SAPHO IDE para instanciação de hardware.",
        "sapho_project_figure_title": "As figuras ilustram a tela de configuração do processador, a estrutura da pasta do projeto e um fluxograma detalhando o processo de criação do projeto no SAPHO.",
        "sapho_project_folder_image": "Imagem: estrutura de pastas de um projeto no SAPHO (3).",
        "sapho_project_flow_image": "Imagem: fluxograma do processo de criação de um projeto no SAPHO (4).",
        "sapho_compilers_title": "Compiladores",
        "sapho_c_compiler_title": "Compilador C",
        "sapho_sps_title": "Estrutura do programa de arquivo único:",
        "sapho_sps": "o programa deve estar contido em um arquivo e suporta sub-rotinas, permitindo a criação automática de pilha de instruções para retornos de função e algoritmos recursivos.",
        "sapho_compiler_pointer_title": "Limitações de ponteiros:",
        "sapho_compiler_pointer": "os ponteiros são restritos à indexação de matrizes unidimensionais de tamanho fixo para facilitar o cálculo prévio do tamanho da memória.",
        "sapho_compiler_memory_title": "Sem alocação dinâmica de memória:",
        "sapho_compiler_memory": "essa restrição garante a utilização eficiente dos recursos de hardware. Quando arrays são declarados, o compilador gera os circuitos de endereçamento indiretos necessários.",
        "sapho_functions_title": "Funções, palavras-chave e operadores suportados são resumidos em uma tabela, mostrando os recursos do compilador C.",
        "sapho_table_category_title": "Categoria",
        "table_content_title": "Conteúdo",
        "sapho_table_keywords": "Palavras-chave",
        "sapho_table_operators": "Operadores",
        "sapho_asm_compiler_subtitle": "O compilador assembler apresenta 49 instruções e gera o arquivo Verilog que descreve o hardware do processador, juntamente com os arquivos de inicialização para as memórias associadas. Construído com GNU Flex, ele reconhece efetivamente opcodes e operandos. Os principais recursos incluem.",
        "sapho_asm_variable_title": "Reconhecimento de instruções e variáveis:",
        "sapho_asm_variable": "ele avalia o número total de instruções do programa e variáveis necessárias para alocar o tamanho correto para a memória do programa e de dados.",
        "sapho_asm_fpf_title": "Formato de ponto flutuante proposto",
        "sapho_asm_i3e_before": "Em circuitos digitais, os números de ponto flutuante são normalmente representados de acordo com o",
         "sapho_asm_i3e_after": "padrão, usando 32 bits para precisão simples e 64 bits para precisão dupla. Este padrão inclui representações numéricas especiais e define operações aritméticas.",
        "sapho_asm_mantissa": "Esta abordagem permite uma gama flexível de valores de mantissa e expoente, otimizando o desempenho do processador no tratamento de aritmética de ponto flutuante.",
        "sapho_media_resources_note": "Para insights mais detalhados sobre SAPHO, assista aos vídeos acima ou explore artigos e recursos adicionais abaixo.",
        "sapho_references_title": "Referências",
        "sapho_references_subtitle": "Esta seção inclui recursos sobre arquitetura de processador, avanços em computação rápida e artigos de pesquisa para estudo aprofundado.",
        "sapho_references_intel": "Pesquisa Intel - Processador e Arquitetura",
        "sapho_references_arm": "ARM - Arquitetura de Processador",
        "sapho_references_nature": "Nature - Avanços na Computação Quântica",
        "sapho_references_acm": "ACM Journal on Computing Architectures",
        "sapho_references_i3e": "IEEE - Arquitetura de Computadores",
        "sapho_references_fct": "ACM - Técnicas de Computação Rápida",
        "sapho_references_hpc": "HPC Wire - Computação de Alto Desempenho",
        "sapho_references_wiki": "Wikipedia - Arquitetura de Conjunto de Instruções",
        "sapho_licensed": "Licenciado sob",

        "sapho_download_title": "Download SAPHO | NIPSCERN Lab",
        "sapho_download_text_subtitle": "Processador de Arquitetura Escalável para Otimização de Hardware.",
        "sapho_download_documentation": "Ir para Documentação",
        "sapho_download_back": "Voltar para a Página Principal",
        "sapho_download_thanks": "Obrigado por baixar o SAPHO!"
    },
    "no": {
        "home_title": "NIPSCERN - Forskning og innovasjon | NIPSCERN Lab",
         "home_btn_search": "Søk",
         "home_welcome": "Velkommen til NIPSCERN",
         "home_current_research": "Nåværende forskning",
         "home_supporters": "Supportere",
         "home_about_us": "Om oss",
         "home_faq": "FAQ",
         "home_contact_us": "Kontakt oss",
         "home_title_text": "Sammensmeltingen av signalbehandling og partikkelforskning",
         "home_subtitle_text": "Samarbeid globalt for å flytte grensene for fysikk, teknologi og innovasjon.",
         "home_btn_learn_more": "Les mer",
         "home_btn_explore_projects": "Utforsk prosjekter",
         "home_sapho_card": "Programmer prosessorer i C+- med SAPHO: Scalable Architecture Processor for Hardware Optimization.",
         "home_read_more": "Les mer",
         "home_aura_card": "En moderne, funksjonell og vakker IDE med innebygd AI for å programmere prosessorer som bruker C+-språket.",
         "home_alice_card": "En ny optimalisert måte å oversette C+- kode til Assembly. Rask og pålitelig.",
         "home_helvetia_card": "All dokumentasjon av NIPSCERN Lab. Finn instruksjoner, hint, eksempler og mye mer.",
         "home_infinity_card": "Alt-i-ett-app som sparer tid etter formatering av Windows. Last ned nyttige verktøy.",
         "home_cern_card": "Les mer om CERN, European Organization for Nuclear Research.",
         "home_text_about_us": "NIPSCERN er i forkant av innovasjon innen signalbehandling og partikkelforskning, og driver frem gjennombrudd som omformer vår forståelse av universet.",
         "home_title_our_mission": "Vårt oppdrag",
         "home_text_our_mission": "Å utnytte banebrytende teknologier og samarbeidsforskning for å fremme kunnskap og løse komplekse utfordringer innen vitenskap.",
         "home_title_our_vision": "Vår visjon",
         "home_text_our_vision": "Å være en global leder innen forskning og innovasjon, inspirere fremtidige generasjoner til å utforske vitenskapens grenser.",
         "home_title_join_us": "Bli med oss på vår reise!",
         "home_text_join_us": "Sammen kan vi frigjøre nye potensialer innen forskning og teknologi. Utforsk prosjektene våre eller bli involvert!",
         "home_title_faq": "Ofte stilte spørsmål",
         "home_text_faq_q_1": "Hvor ligger NIPSCERN Lab?",
         "home_text_faq_a_1": "NIPSCERN Lab er lokalisert ved Universidade Federal de Juiz de Fora, i delstaten Minas Gerais, Brasil.",
         "home_text_faq_q_2": "Hvilke prosjekter har NIPSCERN utviklet?",
         "home_text_faq_a_2": "Vi har utviklet en rekke prosjekter som AURA IDE, SAPHO, Infinity Manager og mye mer.",
         "home_text_faq_q_3": "Hvordan kan jeg hjelpe laboratoriet?",
         "home_text_faq_a_3": "Du kan bli med oss på vår GitHub i bunnteksten.",
         "home_title_get_touch": "Ta kontakt",
         "home_text_send_message": "Send melding",
         "home_text_contact_info": "Kontaktinformasjon",
         "home_privacy_policy": "Personvernregler",
         "home_terms_service": "Vilkår for bruk",
         "home_footer_license": "Dette verket er lisensiert under en",
        
        
        "cern_title": "CERN historie og ATLAS-prosjekt | NIPSCERN Lab",
        "cern_nav_history": "Historien til CERN",
        "cern_nav_atlas": "ATLAS-prosjekt",
        "cern_nav_media": "Medier og ressurser",
        "cern_nav_references": "Referanser",
        "cern_header_text": "CERN historie og ATLAS-prosjekt",
        "cern_subtitle": "Forstå universet gjennom partikkelfysikk.",
        "cern_intro_text": "Historien til CERN",
        "cern_intro_cern": "CERN, European Organization for Nuclear Research, ble grunnlagt i 1954 av 12 europeiske land i et forsøk på å etablere et forskningsanlegg i verdensklasse for å utforske universets mysterier. I dag er det et av verdens største og mest respekterte sentre for vitenskapelig forskning, med 23 medlemsland og en rekke globale partnerskap CERN er primært lokalisert i Genève. Sveits, med sine fasiliteter som grenser over den fransk-sveitsiske grensen.",
        "cern_intro_mission": "CERNs oppgave er å gi fysikere de nødvendige verktøyene og infrastrukturen for å utføre banebrytende eksperimenter innen subatomær partikkelforskning, og fremme vår forståelse av universet. Organisasjonen har vært i forkant av flere monumentale vitenskapelige prestasjoner.",
        "cern_section_location_title": "Plassering",
        "cern_section_location": "Hovedcampusen til CERN ligger på den fransk-sveitsiske grensen, nær Genève, Sveits. Large Hadron Collider (LHC), den mest kjente av partikkelakseleratorene, går under jorden i en sirkulær tunnel som strekker seg over 27 kilometer ( 17 miles), med deler av den i både Sveits og Frankrike.",
        "cern_section_image_lhc": "Bilde: underjordisk plassering av LHC og de fire hovedeksperimentene.",
        "cern_section_achievements_title": "Prestationer",
        "cern_section_achievements": "CERN har bidratt betydelig til partikkelfysikk, ikke bare gjennom funn, men også gjennom utvikling av teknologier som påvirker samfunnet for øvrig. En av CERNs mest bemerkelsesverdige prestasjoner er konstruksjonen av Large Hadron Collider (LHC), verdens største og kraftigste partikkelakselerator, som ligger 100 meter under jorden. LHC har tillatt forskere å gjennomføre eksperimenter som har utvidet vår forståelse av partikkelfysikk og kreftene som styrer universet.",
        "cern_section_image_ccc": "Bilde: CERNs akseleratorkontrollsenter (CCC), der forskere overvåker og kontrollerer driften av Large Hadron Collider og andre akseleratorer ved laboratoriet.",
        "cern_section_milestones_title": "Nøkkelmilepæler",
        "cern_milestone_1954": "CERN er grunnlagt av 12 europeiske land.",
        "cern_milestone_1989": "Tim Berners-Lee finner opp World Wide Web ved CERN for å møte etterspørselen etter informasjonsdeling mellom fysikere som jobber i forskjellige deler av verden.",
        "cern_milestone_2008": "Large Hadron Collider (LHC), verdens kraftigste partikkelakselerator, begynner å fungere.",
        "cern_milestone_2012": "oppdagelse av Higgs-bosonpartikkelen, en milepæl i partikkelfysikk som bekrefter eksistensen av Higgs-feltet, et nøkkelelement i standardmodellen for partikkelfysikk.",
        "cern_section_image_structure": "Bilde: et diagram som viser organisasjonsstrukturen til CERN, og fremhever dets ulike avdelinger og samarbeid.",
        "cern_section_discoveries_title": "Viktige oppdagelser og eksperimenter",
        "cern_discovery_intro": "CERNs oppdagelser har revolusjonert vår forståelse av partikkelfysikk. Her er noen av de viktigste eksperimentene og funnene:",
        "cern_discovery_higgs_title": "The Higgs Boson Discovery (2012):",
        "cern_discovery_higgs": "et av de mest kjente eksperimentene utført ved CERN var søket etter Higgs-bosonet. Denne unnvikende partikkelen ble teoretisert for å gi masse til andre partikler. Etter tiår med forskning ble Higgs-bosonet endelig oppdaget i 2012 av ATLAS og CMS-detektorer ved LHC. Denne oppdagelsen fikk forskerne François Englert og Peter Higgs nobelprisen i fysikk i 2013.",
         "cern_discovery_web_title": "The World Wide Web (1989):",
        "cern_discovery_web": "Tim Berners-Lee, en britisk vitenskapsmann som jobber ved CERN, oppfant World Wide Web som et middel for forskere over hele verden til å dele og få tilgang til data. Denne oppfinnelsen har siden forvandlet kommunikasjon, handel og global tilkobling." ,
        "cern_discovery_antimatter_title": "Antimaterieeksperimenter:",
        "cern_discovery_antimatter": "CERN er også kjent for sin forskning på antimaterie. I 1995 skapte CERNs forskere de første antihydrogenatomene. Å forstå antimaterie kan føre til gjennombrudd på felt som spenner fra energi til medisinsk teknologi.",
        "cern_discovery_quark_gluon_title": "Quark-Gluon Plasma:",
        "cern_discovery_quark_gluon": "CERNs ALICE-eksperiment har vært medvirkende til å studere kvark-gluon-plasma, en materietilstand som antas å ha eksistert like etter Big Bang. Ved å kollidere tunge ioner ved ekstreme energier, gjenskaper forskere ved CERN forhold som ligner de ved universets fødsel.",
        "cern_section_curiosities_title": "Kuriositeter om CERN",
        "cern_curiosity_data_title": "Databehandling:",
        "cern_curiosity_data": "CERN genererer enorme mengder data, omtrent 30 petabyte (30 millioner gigabyte) årlig, som behandles av et globalt nettverk av datasentre.",
        "cern_curiosity_detector_title": "Atlasdetektoren:",
        "cern_curiosity_detector": "ATLAS-detektoren på CERN er 45 meter lang, 25 meter i diameter, og veier like mye som Eiffeltårnet!",
        "cern_curiosity_collaboration_title": "Internasjonalt samarbeid:",
        "cern_curiosity_collaboration": "CERN sysselsetter forskere fra mer enn 100 forskjellige nasjonaliteter, og fremmer et globalt miljø for vitenskapelig fremgang.",
        "cern_curiosity_black_holes_title": "Teorier om svarte hull:",
        "cern_curiosity_black_holes": "noen eksperimenter ved CERN har ført til spekulasjoner om potensialet for å skape mikrosorte hull, selv om det ikke er noen risiko for Jorden, siden slike sorte hull ville fordampe nesten umiddelbart.",
        "cern_atlas_title": "ATLAS-prosjekt",
        "cern_atlas_experiment": "ATLAS-eksperimentet ved CERN er et av de største og mest komplekse eksperimentene som noen gang er konstruert innen partikkelfysikk. Det er en generell partikkeldetektor ved Large Hadron Collider (LHC), designet for å utforske de grunnleggende partiklene og kreftene som utgjør universet Med et samarbeid med tusenvis av forskere fra hele verden, hjelper ATLAS med å svare på noen av de største spørsmålene innen fysikk.",
        "cern_atlas_discovery": "ATLAS var medvirkende til oppdagelsen av Higgs-bosonet i 2012, en banebrytende oppdagelse som bekreftet eksistensen av Higgs-feltet, en nøkkelkomponent i standardmodellen for partikkelfysikk. Utover Higgs-bosonet, har ATLAS som mål å oppdage et bredt utvalg av fenomener, som ekstra dimensjoner, supersymmetri og partikler som kan forklare den mystiske mørke materien som utgjør mye av universet.",
        "cern_atlas_location": "ATLAS-detektoren ligger 100 meter under bakken, 46 meter lang, 25 meter i diameter og veier rundt 7000 tonn. Dens enorme størrelse gjør at den kan fange opp et bredt spekter av partikkelinteraksjoner, og gir forskere uvurderlige data for å videreføre forstå den subatomære verden.",
        "cern_atlas_nipscern_title": "NIPSCERNs bidrag til ATLAS",
        "cern_atlas_nipscern": "NIPSCERN-laben er aktivt involvert i ATLAS-prosjektet. Forskere fra laboratoriet bidrar til analysen av de enorme datamengdene som genereres av partikkelkollisjonene ved LHC. Ved hjelp av avanserte beregningsverktøy og algoritmer hjelper NIPSCERN-forskere med å behandle og tolke dataene, som er avgjørende for å identifisere sjeldne og signifikante partikkelinteraksjoner.",
        "cern_atlas_experiment_image": "Bilde: en visning av ATLAS-eksperimentets enorme partikkeldetektor under bygging på CERN. Detektoren spenner over 46 meter og er ansvarlig for å fange data fra høyenergipartikkelkollisjoner ved LHC.",
        "cern_atlas_goal_title": "Mål for ATLAS-prosjektet",
        "cern_atlas_study_title": "Studer Higgs-bosonet:",
        "cern_atlas_study": "etter oppdagelsen av Higgs-bosonet, fortsetter ATLAS å studere egenskapene mer detaljert for å bedre forstå hvordan partikler tilegner seg masse.",
        "cern_atlas_search_title": "Søk etter mørk materie:",
        "cern_atlas_search": "et av ATLAS sine mest ambisiøse mål er å oppdage partikler som kan forklare mørk materie, en usynlig form for materie som utgjør omtrent 27 % av universet.",
        "cern_atlas_susy_title": "Undersøk supersymmetri (SUSY):",
        "cern_atlas_susy": "ATLAS søker etter bevis på supersymmetri, en teori som utvider standardmodellen ved å forutsi eksistensen av partnerpartikler for hver kjent partikkel, noe som kan bidra til å løse mysterier som mørk materie og forene krefter.",
        "cern_atlas_string_title": "Utforsk ekstra dimensjoner:",
        "cern_atlas_string": "eksperimentet ser etter tegn på ekstra romlige dimensjoner, som teorier som strengteori antyder kan eksistere utover de tre romlige dimensjonene vi oppfatter.",
        "cern_discovery_title": "Betydende oppdagelser og forskningsområder",
        "cern_discovery_subtitle": "I tillegg til Higgs-bosonet har ATLAS produsert betydelig innsikt innen mange områder av partikkelfysikk. Her er noen bemerkelsesverdige bidrag:",
        "cern_measurement_title": "Presisjonsmålinger:",
        "cern_measurement": "ATLAS har gjort presise målinger av standardmodellprosesser, for eksempel produksjonen av W- og Z-bosoner, som bidrar til å forbedre vår forståelse av grunnleggende krefter.",
        "cern_quark_title": "Top Quark-studier:",
        "cern_quark": "ATLAS har gitt nøkkeldata om toppkvarken, den tyngste kjente elementærpartikkelen, som spiller en avgjørende rolle i å teste standardmodellen.",
        "cern_model_title": "Ny fysikk utover standardmodellen:",
        "cern_model": "ATLAS fortsetter å utforske potensielle nye partikler og krefter utover standardmodellen, for eksempel hypotetiske partikler relatert til mørk materie eller eksotiske former for materie som kvark-gluonplasma.",
        "cern_discovery_image": "Bilde: ATLAS gir første måling av W-bosonbredden ved LHC.",
        "cern_facts_title": "Interessante fakta om ATLAS",
        "cern_scale_title": "Omfang av samarbeid:",
        "cern_scale": "ATLAS involverer rundt 3000 forskere fra over 180 institusjoner i 38 land, noe som gjør det til et av de mest samarbeidende vitenskapelige prosjektene i historien.",
        "cern_data_title": "Datavolum:",
        "cern_data": "ATLAS-eksperimentet produserer en enorm mengde data – over 10 petabyte per år, noe som krever avanserte datanettverk over hele kloden for å behandle informasjonen.",
        "cern_detector_title": "Detektorens kompleksitet:",
        "cern_detector": "ATLAS er sammensatt av flere lag med forskjellige typer detektorer som måler forskjellige partikkelegenskaper, inkludert deres veier, energi og momentum.",
        "cern_media_resources": "Medier og ressurser",
        "cern_media_resources_subtitle": "For mer detaljert innsikt i CERNs arbeid, se videoene ovenfor eller utforsk flere artikler og ressurser nedenfor.",
        "cern_media_references": "Referanser",
        "cern_media_references_title": "Denne siden inneholder informasjon fra en rekke kilder, og tilbyr både detaljert innsikt og lettfattelige ressurser om CERN og ATLAS-prosjektet:",
        "cern_media_references_cern": "CERN offisielle nettsted",
        "cern_media_references_atlas": "ATLAS eksperimentoversikt",
        "cern_media_references_wiki": "Wikipedia - CERN",
        "cern_media_references_nature": "Naturartikkel om Higgs Discovery",
        "cern_media_references_wiki_atlas": "Wikipedia - ATLAS-eksperiment",
        "cern_media_references_higgs": "CERN Document Server - Higgs Boson Discovery Paper",
        "cern_media_references_model": "CERN - Standardmodell for partikkelfysikk",
        "cern_media_references_matter": "Naturen - Jakten på mørk materie",
        "cern_media_references_exp": "CERN-eksperimentoversikt",
        "cern_media_references_magazine": "CERN Courier Magazine",
        "cern_license": "Lisensert under",
        
        "alice_title": "ALICE - Monteringslogisk instruksjon for C+-motor | NIPSCERN Lab",
        "alice_overview": "Oversikt",
        "alice_compiler_flow": "Kompileringsflyt",
        "alice_video_diagram": "Video og diagram",
        "alice_documentation": "Dokumentasjon",
        "alice_title_text": "*ALICE: Monteringslogisk instruksjon for C+-motor",
        "alice_subtitle_text": "En innovativ monteringsmotor optimalisert for C+--kode, som gjør kompleks logikk til optimaliserte instruksjoner for skalerbare prosessorer.",
        "alice_documentation_text": "Gå til dokumentasjon",
        "alice_compiler_flow_text": "Kompileringsflyt",
        "alice_input": "Kilde C+- kodefilen, startpunktet for kompileringsprosessen.",
        "alice_token": "Spalter inndatafilen i tokens (søkeord, identifikatorer, osv.).",
        "alice_parser": "Analyserer tokensekvenser basert på grammatikkregler for å lage syntakstreet.",
        "alice_ast_construction_title": "AST-konstruksjon:",
        "alice_ast_construction": "Genererer det abstrakte syntakstreet (AST) som representerer programstrukturen.",
        "alice_lexical_analysis_title": "Generert leksikalsk analyse:",
        "alice_lexical_analysis": "Utgangen fra den leksikalske analysatoren basert på tokens.",
        "alice_parsing_title": "Generert parsing:",
        "alice_parsing": "Generert analyselogikk, avledet fra grammatikkreglene.",
        "alice_handling_title": "Inkluder håndtering:",
        "alice_handling": "Håndterer alle filene som er spesifisert i kildekoden.",
        "alice_output": "Utgang:",
        "alice_output_title": "Endelig monteringskode, klar til å kjøre på prosessoren.",
        "alice_flow_comp_title": "Sammenstillingen forvandles",
        "alice_flow_comp_inter": "inn i",
        "alice_flow_comp_final": "gjennom disse sekvensielle trinnene.",
        "alice_flow_input_file": "Dette er inndatafilen.",
        "alice_flow_exe": "Som går direkte til myccompiler.exe",
        "alice_token_process": "Her begynner kompilatoren å tokenisere tekststrømmen fra test.cmm.",
        "alice_token_generated": "Tokens:",
        "alice_token_stream": "Deretter sjekker *ALICE-kompilatoren om inndatastrømmen av tokens er gyldig i henhold til grammatikken.",
        "alice_nodes": "Flere noder opprettes av 'create_node'-funksjonen. I dette eksemplet er det laget fem produksjoner/reduksjoner:",
        "alice_asm_output": "Til slutt genererer *ALICE-kompilatoren ASM-utgangskoden basert på nodene opprettet av create_node-funksjonen i forrige trinn.",
        "alice_nodes_title": "Noder:",
        "alice_asm_output_text": "Dette er utdatafilen.",
        "alice_video_example_title": "Eksempelvideo",
        "alice_diagram_flow_title": "Sammenstillingsflytdiagram",
        "alice_diagram_flow_button": "Vis diagram",
        "alice_features_title": "Funksjoner",
        "alice_fast_compilation_title": "Rask kompilering",
        "alice_fast_compilation": "*ALICE kompilerer C+- kode raskt og effektivt for optimalisert ytelse.",
        "alice_multi_file_title": "Støtte for flere filer",
        "alice_multi_file": "Kompiler flere filer samtidig med nøyaktig feilsporing etter linje.",
        "alice_stack_size_title": "Egendefinert stabelstørrelse",
        "alice_stack-size": "Justerbar stabelstørrelse for raskere prosessering og maskinvareoptimalisering.",
        "alice_processor_title": "Prosessorvalg",
        "alice_processor": "Velg mellom fastpunkt- eller flytendepunktprosessortyper.",
        "alice_directive_title": "Direktiv administrasjon",
        "alice_directive": "Støtter et bredt spekter av direktiver med tilpassbare parametere.",
        "alice_future_features": "Fremtidige funksjoner",
        "alice_enhanced_error_title": "Forbedret feilrapportering",
        "alice_enhanced_error": "Mer detaljerte feil- og advarselsrapporter.",
        "alice_performance_optm_title": "Ytelsesoptimalisering",
        "alice_performance_optm": "Raskere kompilering og innebygde kodeoptimaliseringstips.",
        "alice_plugin_title": "Pluginsystem",
        "alice_plugin": "Støtte for tillegg og fellesskapsbygde verktøy.",
        "alice_stonks_title": "Statistisk innsikt",
        "alice_stonks": "Datadrevne forslag til kodeforbedringer.",
        "alice_security_title": "Sikkerhetsforbedringer",
        "alice_security": "Forbedret pålitelighet og sikkerhetsfunksjoner.",
        "alice_alice_documentation_title": "ALICE-dokumentasjon",
        "alice_alice_documentation": "Finn detaljert informasjon og veiledninger om ALICE Assembly Logical Instruction for C Engine.",
        "alice_alice_documentation_button": "Les dokumentasjon",
        "alice_alice_license": "Lisensert under",
        
        
        "infinity_title": "Infinity Manager | NIPSCERN Lab",
        "infinity_initial_title": "Uendelig",
        "infinity_final_title": "Administrator",
        "infinity_subtitle": "Nedlastingsbehandling for NIPSCERN Lab Tools",
        "infinity_welcome_title": "Velkommen til Infinity Manager, den dedikerte nedlastingsbehandleren for NIPSCERN Lab. Designet med forskere og utviklere i tankene, forenkler Infinity Manager prosessen med å få tilgang til viktige programvareverktøy som kreves for innovative prosjekter innen signalbehandling og beregningsforskning. .",
        "infinity_summary_1": "Det primære målet med Infinity Manager er å strømlinjeforme programvareinstallasjon og -administrasjon for brukere ved NIPSCERN Lab. Ved å tilby en sentralisert plattform for å laste ned, installere og oppdatere ulike programvareapplikasjoner, øker Infinity Manager produktiviteten og sikrer at alle brukere har enkel tilgang til de nyeste verktøyene som er nødvendige for arbeidet deres.",
        "infinity_summary_2": "Infinity Manager fremmer også samarbeid i laboratoriet ved å tillate enkel deling og distribusjon av programvare blant teammedlemmer. Med et intuitivt brukergrensesnitt og omfattende dokumentasjon kan brukere enkelt navigere gjennom de tilgjengelige programvarealternativene, og sikre at de har de riktige verktøyene til fingerspissene for vellykket prosjektgjennomføring.",
        "infinity_available_software_title": "Tilgjengelig programvare:",
        "infinity_available_software": "og mer kommer snart.",
        "infinity_future_software": "Fremtidig programvaretilgjengelighet: Hos Infinity Manager er vi forpliktet til å kontinuerlig utvide programvaretilbudene våre for å sikre at du har tilgang til de mest effektive verktøyene for dine utviklings- og produktivitetsbehov. I fremtiden har vi som mål å inkludere enda flere programmer som imøtekommer ulike aspekter av programvareutvikling, dataanalyse, design og samarbeid.",
        "infinity_open_source": "Betydningen av åpen kildekode-programvare: Åpen kildekode-programvare spiller en viktig rolle i dagens teknologiske landskap. Ved å gi tilgang til kildekode oppmuntrer det til åpenhet, samarbeid og innovasjon. Åpen kildekode-programmer gir utviklere mulighet til å modifisere og forbedre programvare i henhold til til deres unike behov, og fremmer en fellesskapsdrevet tilnærming til problemløsning.",
        "infinity_do_more": "Utforsk, bidra og innover: Mens vi bygger Infinity Manager-plattformen, inviterer vi deg til å utforske de nåværende tilbudene og gi tilbakemelding på hvilke verktøy du finner mest verdifulle. Sammen kan vi skape en ressurs som ikke bare oppfyller dine behov, men bidrar også til det blomstrende åpen kildekode-økosystemet.",
        "infinity_thanks": "Takk for at du valgte Infinity Manager - din inngangsport til viktige programvareløsninger for NIPSCERN Lab.",
        "infinity_find_us": "Finn oss",
        "infinity_learn_more": "Lær mer",
        "infinity_learn_more_cern": "Om CERN",
        "infinity_visit": "Besøk",
        "infinity_visit_cnpq_ufjf": "CNPq og UFJF",
        "infinity_licensed": "NIPSCERN er lisensiert under CC BY-NC-SA 4.0",

        "privacy_title": "Personvernregler | NIPSCERN Lab",
        "privacy_policy_title": "Personvernregler",
        "privacy_last_updated": "Sist oppdatert: 10.09.2024",
        "privacy_subtitle": "På NIPSCERN Lab respekterer vi ditt personvern og er forpliktet til å opprettholde åpenhet. Vi samler ikke inn, lagrer eller behandler noen personopplysninger fra brukerne våre.",
        "privacy_data_collection_title": "1. Datainnsamling",
        "privacy_data_collection": "NIPSCERN Lab samler ikke inn personlig informasjon fra besøkende eller brukere. Vi bruker ikke informasjonskapsler, sporingsmekanismer eller analyseverktøy som samler inn personlige data.",
        "privacy_third_party_title": "2. Tredjepartskoblinger",
        "privacy_third_party": "Nettstedet vårt kan inneholde lenker til tredjeparts nettsteder, inkludert våre partnere som CNPq, UFJF og CERN. Vi oppfordrer deg til å gjennomgå personvernreglene deres før du tar kontakt med dem.",
        "privacy_open_source_title": "3. Åpen kildekode-filosofi",
        "privacy_open_source": "Alle prosjekter utviklet ved NIPSCERN Lab er åpen kildekode. Vi sporer eller overvåker ikke hvem som får tilgang til eller laster ned programvaren vår.",
        "privacy_rights_title": "4. Dine rettigheter",
        "privacy_rights": "Siden vi ikke samler inn noen data, er det ingen brukerrettigheter knyttet til personlig informasjon i systemene våre.",
        "privacy_contact_title": "5. Kontaktinformasjon",
        "privacy_contact": "For spørsmål angående denne personvernreglene, vennligst kontakt oss på contact@nipscern.com.",
        "privacy_back": "Tilbake til hovedsiden",


        "service_title": "Vilkår for bruk | NIPSCERN Lab",
        "service_terms_service_title": "Vilkår for bruk",
        "service_last_updated": "Sist oppdatert: 10.09.2024",
        "service_welcome": "Velkommen til NIPSCERN Lab! Vår oppgave er å bygge åpen kildekodeprosjekter av høy kvalitet. Ved å gå inn på eller bruke nettstedet vårt godtar du disse vilkårene for bruk.",
        "service_acceptance_terms": "1. Aksept av vilkår",
        "service_acceptance_text": "Ved å gå inn på og bruke NIPSCERN Labs nettsted eller prosjekter godtar du å overholde og være bundet av disse vilkårene.",
        "service_open_source_projects": "2. Bruk av åpen kildekode-prosjekter",
        "service_open_source_text": "Alle prosjekter utviklet av NIPSCERN Lab er åpen kildekode og tilgjengelig for bruk under relevante åpen kildekode-lisenser.",
        "service_disclaimer_warranties": "3. Fraskrivelse av garantier",
        "service_disclaimer_text": "NIPSCERN Lab tilbyr nettsiden, prosjektene og programvaren \"som den er\". Vi garanterer ikke påliteligheten eller funksjonaliteten til programvaren vi utgir.",
        "service_collaborations": "4. Samarbeid",
        "service_collaborations_text": "Vi er stolte av å samarbeide med CNPq, UFJF og CERN. Imidlertid opererer NIPSCERN Lab uavhengig og er ikke ansvarlig for retningslinjene eller praksisene til disse organisasjonene.",
        "service_limitation_liability": "5. Ansvarsbegrensning",
        "service_limitation_text": "NIPSCERN Lab skal ikke holdes ansvarlig for skader som følge av bruk eller manglende evne til å bruke programvaren eller nettstedet vårt.",
        "service_changes_terms": "6. Endringer i vilkårene",
        "service_changes_text": "Vi forbeholder oss retten til å oppdatere disse vilkårene. Fortsatt bruk av nettstedet vårt etter at endringer er gjort, utgjør aksept av de reviderte vilkårene.",
        "service_contact_information": "7. Kontaktinformasjon",
        "service_contact_text": "For spørsmål angående disse vilkårene for bruk, vennligst kontakt oss på contact@nipscern.com.",
        "service_back": "Tilbake til hovedsiden",
        
        
        "sapho_title": "SAPHO - skalerbar arkitekturprosessor for maskinvareoptimalisering | NIPSCERN Lab",
        "sapho_nav_introduction": "Introduksjon",
        "sapho_nav_ide": "IDE",
        "sapho_nav_compiler": "Kompilatorer",
        "sapho_nav_media": "Medier og ressurser",
        "sapho_nav_references": "Referanser",
        "sapho_subtitle": "Skalerbar arkitekturprosessor for maskinvareoptimalisering.",
        "sapho_documentation": "Gå til dokumentasjon",
        "sapho_introduction_title": "SAPHO: en introduksjon",
        "sapho_introduction": "Den faste arkitekturen til for øyeblikket tilgjengelige prosessor Soft Cores (PSCer) er en vanlig egenskap blant dem. Dette betyr at samme mengde maskinvareressurser tildeles uavhengig av det innebygde programmet. Videre er ordstørrelsen fast og er typisk overdimensjonert Denne nettsiden presenterer en skalerbar mykkjerneprosessor utviklet ved signalbehandlings- og instrumenteringskjerne ved ingeniørfakultetet ved UFJF (Federal University of Juiz de Fora).",
        "sapho_overview_title": "Oversikt over SAPHO",
        "sapho_overview_open-source": "SAPHO, som står for Scalable Architecture Processor for Hardware Optimization, er en mykkjerneprosessor med åpen kildekode designet for å automatisk tildele nødvendige maskinvareressurser under kompileringstiden for innebygde programmer. Den brukes primært i multi- kjerneprosesseringsrammer og har blitt implementert i ulike etablerte systemer.",
        "sapho_overview_compilers": "Funksjonaliteten til SAPHO er basert på de to kompilatorene, tilgjengelig gjennom dets hovedintegrerte utviklingsmiljø (IDE). Den første kompilatoren, C+−, er ansvarlig for å tolke programmer skrevet i en undergruppe av C-språket og konvertere dem til Assembly-språk Den andre kompilatoren tar Assembly-koden generert av den første kompilatoren og oversetter den til maskinkode, allokerer de nødvendige maskinvareressursene og genererer en konfigurasjonsfil i Verilog.",
        "sapho_overview_assembler": "Sammenstilleren identifiserer først instruksjonene produsert av det brukerskrevne programmet og lager deretter bare maskinvareressursene som trengs for utførelse. De fleste konfigurasjoner, for eksempel utvikling av interne kretser for Arithmetic Logic Unit (ALU), er automatiserte Programmerere kan endre tilleggsfunksjoner, inkludert ordstørrelse, ALU-type (fastpunkt eller flytende punkt), og antall inngangs- og utgangsporter, ved å bruke kompileringsdirektiver.",
        "sapho_overview_psc": "Et sentralt skille mellom SAPHO og tilgjengelige PSC-er ligger i dens evne til å justere arkitekturen basert på det implementerte programmet. Imidlertid mister den muligheten til å oppdatere programmet under kjøring. Ikke desto mindre, i mange nåværende applikasjoner, er fordelene med ressursoptimalisering rettferdiggjør denne begrensningen.",
        "sapho_description_title": "Beskrivelse av SAPHO",
        "sapho_description_harvard": "SAPHO er basert på en Harvard-arkitektur og har en RISC-design (Reduced Instruction Set Computer), som lar den bestemme de nødvendige maskinvareressursene basert på brukerens applikasjon. Arithmetic Logic Unit (ALU) i SAPHO kan være konfigurert for både fastpunkt- og flyttalloperasjoner, og minnesystemene - både data og program - har selvskalerende adresser.",
        "sapho_description_tools": "I tillegg til selve prosessoren, som inkluderer dens kjerne og to minneenheter, er flere verktøy utviklet for å lette programmering. Disse verktøyene inkluderer et utviklingsgrensesnitt, en kompilator som tolker en delmengde av C-språket kjent som C+ −, og en montør.",
        "sapho_advantages_title": "Noen av fordelene ved å bruke SAPHO-prosessoren inkluderer:",
        "sapho_advantages_instruction_title": "Enkelt instruksjonsutførelse per klokkesyklus:",
        "sapho_advantages_instruction": "den kan utføre én instruksjon per klokkesyklus, selv i rutiner med betingede hopp, uten å forstyrre rørledningen, takket være dens tre-trinns rørledningsarkitektur.",
        "sapho_advantages_alu_title": "Konfigurerbar ALU:",
        "sapho_advantages_alu": "ALU kan justeres for variable ordstørrelser og kan håndtere både fastpunkt- og flyttalloperasjoner.",
        "sapho_advantages_resource_title": "Parameterisert ressursallokering:",
        "sapho_advantages_resource": "ressursene tildeles på en parametrisert måte på designtidspunktet, skreddersydd for den spesifikke applikasjonen som er utviklet.",
        "sapho_advantages_flexibility_title": "Programmeringsfleksibilitet:",
        "sapho_advantages_flexibility": "brukere kan programmere prosessoren ved å bruke enten en undergruppe av C-språket eller direkte i Assembly-språket.",
        "sapho_architecture_title": "SAPHOs maskinvarearkitektur",
        "sapho_architecture_blocks": "De primære blokkene til SAPHO-arkitekturen er illustrert i figur 1, der heltrukket linjer indikerer flyten av data, og stiplede linjer representerer kontrollsignaler. De lysegule blokkene instansieres automatisk ved behov, avhengig av det innebygde programmet, mens de lyseblå blokkene alltid er instansierte Siden begge minneenhetene er synkrone, er de tre rørledningstrinnene som kreves av prosessoren avbildet i figur 2.",
        "sapho_architecture_data": "Pekere for datastakken og instruksjonsstakken (Stack Pointer og Instruction Pointer) administrerer lese- og skriveoperasjonene i sine respektive stabler, som deles mellom data- og programminnene. I dataminnet brukes stabelen for midlertidig datalagring via PUSH- og POP-instruksjoner og deres varianter I programminnet muliggjør stabelen bruk av subrutiner med CALL- og RETURN-instruksjoner.",
        "sapho_architecture_circuits": "Når ALU er konfigurert for flyttalloperasjoner, blir transformasjonskretser mellom fastpunkt- og flyttallsrepresentasjoner automatisk instansiert på inngangs- og utgangsbussene, slik at prosessoren kan kommunisere med I/O-enheter ved hjelp av heltall i tos komplementnotasjon.",
        "sapho_architecture_block_image": "Bilde: SAPHO-prosessorblokkdiagram (1).",
        "sapho_architecture_pipeline_image": "Bilde: diagram over rørledningstrinn utført av SAPHO (2).",
        "sapho_architecture_explanation": "Nedenfor kan du se en mer detaljert forklaring av hver prosessorblokk vist i figur 1.",
        "sapho_architecture_program": "Data og programminne",
        "sapho_code": "Som tidligere nevnt, er størrelsen på dataene og programminnene bestemt av den skrevne koden. Monteringskompilatoren beregner antall adresser som kreves for å lagre alle instruksjoner og variabler fra programkoden, og parameteriserer dermed forekomsten av minner Samleren genererer innholdet i disse minnene og lagrer det i minneinitialiseringsfiler (med en .mif-utvidelse), som instansieres i FPGA sammen med prosessormaskinvaren.",
        "sapho_program_counter": "Programteller - PC",
        "sapho_program_counter_text": "Denne blokken peker på plasseringen av instruksjonen i minnet som skal leses fra programminnet. Under normal programkjøring økes den etter hver instruksjon. Når en hoppinstruksjon oppdages, blir den lastet med en spesifikk verdi som refererer til neste instruksjon Størrelsen, i biter, på PC-en er definert av assembly-kompilatoren basert på størrelsen på programminnet.",
        "sapho_prefetch": "Forhåndshent",
        "sapho_prefetch_text": "Mens prosessoren utfører gjeldende instruksjon, henter den også neste instruksjon fra programminnet (ROM) (1. pipeline-trinn). Den skiller op-koden fra operanden, som er sammenkoblet i ROM-en, og kontrollerer instruksjonsdekoder og programtelleren.",
        "sapho_decoder_text": "Instruksjonsdekoder",
        "sapho_decoder": "Instruksjonsdekoderen mottar opkoden, tolker den og sender de riktige kontrollsignalene, for eksempel de for ALU-operasjonen, aktiverer datautgang, tildeler verdier i registerfilen når arrays brukes, muliggjør dataskriving til minnet , og sender PUSH- og POP-signaler til blant annet Stack Pointer.",
        "sapho_register_text": "Registrer fil",
        "sapho_register": "Registerfilen opprettes hver gang arrays brukes i brukerens program. Dens funksjon er å korrekt indeksere elementene i arrayen, forskyve minneposisjonen til det første elementet for å få tilgang til ønsket elements posisjon.",
        "sapho_alu": "Aritmetisk logikkenhet (ALU)",
        "sapho_alu_text": "ALU-en til denne mykkjerneprosessoren tilbyr en betydelig grad av automatisert parameteriseringsfleksibilitet. Som et resultat kan prosessorens struktur modifiseres for å passe til det tiltenkte formålet. ALU-en parametreres automatisk av assembly-kompilatoren basert på instruksjoner produsert av C+−-kompilatoren, i tillegg til parametere valgt av brukeren på designtidspunktet, for eksempel aritmetikk med fast punkt eller flytende punkt og bitstørrelsen til ordet. Kretsene opprettet automatisk av assembleren kan finnes i Tabell 2. Den tredje kolonnen angir hvilke kretser som er opprettet innenfor ALU, mens de andre er opprettet eksternt. Følgende kolonner viser hvilke kretser som er opprettet for fastpunkts- eller flyttallsprosessorer.",
        "sapho_table_instruction": "Instruksjon",
        "sapho_table_circuit": "Krets",
        "sapho_table_alu": "ALU",
        "sapho_table_fixed_point": "Fast punkt",
        "sapho_table_floating_point": "Flytepunkt",
        "sapho_table_division": "Divisjon",
        "sapho_table_bitwise_or": "Bitvis ELLER",
        "sapho_table_greater": "Større enn",
        "sapho_table_mod": "Modul",
        "sapho_table_less": "Mindre enn",
        "sapho_table_equal": "Like med",
        "sapho_table_bitwise_and": "Bitvis OG",
        "sapho_table_logical_and": "Logisk OG",
        "sapho_table_bitwise_not": "Bitvis IKKE",
        "sapho_table_logical_not": "Logisk IKKE",
        "sapho_table_shift_r": "Skift til høyre",
        "sapho_table_shift_l": "Skift til venstre",
        "sapho_table_arithmetic": "Aritmetisk skift",
        "sapho_table_stack": "Stabelpeker",
        "sapho_table_indirect": "Indirekte adressering",
        "sapho_table_note": "Tabell: Instruksjoner og respektive kretser opprettet automatisk.",
        "sapho_software_overview": "Programvareoversikt over SAPHO",
        "sapho_software_conversion": "Denne strømlinjeformede tilnærmingen lar utviklere effektivt konvertere høynivå C+−-kode til en lavnivå maskinvarebeskrivelse egnet for FPGA-implementering, optimalisere prosessen med maskinvaredesign og sikre at de nødvendige minnestrukturene er på plass for den tiltenkte søknad.",
        "sapho_ide_title": "Oversikt over integrert utviklingsmiljø (IDE)",
        "sapho_ide_subtitle": "SAPHO-prosessorens IDE, utviklet i C#, gir viktige funksjoner for parameterisering og kompilatoranrop. Hovedgrensesnittet inkluderer fem nøkkelområder:",
        "sapho_ide_menu_title": "Menylinje:",
        "sapho_ide_menu": "tilbyr alternativer for å lage nye prosjekter, administrere det nåværende prosjektet eller avslutte programmet.",
        "sapho_ide_toolbar_title": "Verktøylinje:",
        "sapho_ide_toolbar": "plassert under menylinjen, og har hurtigtilgangsikoner for å legge til nye prosessorer og starte C+− og Assembly kompilatorer.",
        "sapho_ide_tree_title": "Prosjekthierarkitre:",
        "sapho_ide_tree": "viser alle prosessorer i prosjektet og gir tilgang til C+− og monteringsfiler for hver prosessor.",
        "sapho_ide_window_title": "Programmeringsvindu:",
        "sapho_ide_window": "gjør det mulig for brukere å skrive og vise kode i C+− og Assembly, organisert gjennom åpne faner.",
        "sapho_ide_console_title": "Konsollvindu:",
        "sapho_ide_console": "viser kompileringsmeldinger, inkludert feil og advarsler, og viser antall instruksjoner og variabler etter vellykket kompilering.",
        "sapho_project_title": "Opprette et nytt prosjekt",
        "sapho_project_subtitle": "Ved å åpne IDE, må brukere opprette et nytt prosjekt ved å navigere til Fil > Nytt prosjekt, hvor de kan navngi prosjektet og velge en katalog (unngå mellomrom eller spesialtegn). Når prosjektet er opprettet, vises det i hierarkietre, og alternativer for å legge til prosessorer blir tilgjengelig.",
        "sapho_project_ide_title": "Legge til en prosessor i IDE",
        "sapho_project_ide_subtitle": "Etter å ha opprettet et prosjekt, kan brukere legge til en prosessor ved å klikke på den aktiverte knappen, som åpner prosessorkonfigurasjonsskjermen. Denne skjermen inkluderer fire hovedkonfigurasjonsfelt.",
        "sapho_project_general_title": "Generelle innstillinger:",
        "sapho_project_general_before": "brukere oppgir et navn for prosessoren, som også vil bli brukt for den genererte",
        "sapho_project_general_inter_after": "og",
        "sapho_project_general_after": "filer.",
        "sapho_project_alu_title": "ALU-innstillinger:",
        "sapho_project_alu": "brukere kan velge antall biter for fastpunktrepresentasjon eller spesifisere antall biter for mantissen og eksponenten i flytepunktsrepresentasjon.",
        "sapho_project_memory_title": "Innstillinger for minnestabel:",
        "sapho_project_memory": "størrelsene på data- og instruksjonsstablene er definert her hvis de brukes.",
        "sapho_project_io_title": "Inndata/utdatainnstillinger",
        "sapho_project_io": "brukere etablerer antall inn- og utgående adresser.",
        "sapho_project_config_before": "Alle konfigurasjonsparametere skrives automatisk som kompileringsdirektiver på begynnelsen av",
        "sapho_project_config_after": "fil, fungerer som en overskrift og påvirker maskinvareressursene som brukes.",
        "sapho_project_data_mif_before": "Ved å fullføre kompileringsprosessen (C+− etterfulgt av Assembly), to minneinitialiseringsfiler",
        "sapho_project_data_mif_inter": "og",
        "sapho_project_data_mif_after": "skapes, som inneholder innholdet av henholdsvis data og programminner. I tillegg genereres en Verilog-fil som innkapsler parameterne spesifisert i SAPHO IDE for maskinvareforekomst.",
        "sapho_project_figure_title": "Tallene illustrerer prosessorkonfigurasjonsskjermen, prosjektmappestrukturen og et flytskjema som beskriver prosjektets opprettelsesprosess i SAPHO.",
        "sapho_project_folder_image": "Bilde: mappestruktur for et prosjekt i SAPHO (3).",
        "sapho_project_flow_image": "Bilde: flytskjema over prosessen med å lage et prosjekt i SAPHO (4).",
        "sapho_compilers_title": "Kompilatorer",
        "sapho_c_compiler_title": "C-kompilator",
        "sapho_sps_title": "Enkeltfil programstruktur:",
        "sapho_sps": "Programmet må være inneholdt i én fil og støtter subrutiner, noe som muliggjør automatisk oppretting av instruksjonsstabel for funksjonsretur og rekursive algoritmer.",
        "sapho_compiler_pointer_title": "Begrensninger for peker:",
        "sapho_compiler_pointer": "pekere er begrenset til å indeksere endimensjonale matriser med fast størrelse for å lette tidligere beregning av minnestørrelse.",
        "sapho_compiler_memory_title": "Ingen dynamisk minnetildeling:",
        "sapho_compiler_memory": "denne begrensningen sikrer effektiv utnyttelse av maskinvareressurs. Når arrays er deklarert, genererer kompilatoren nødvendige indirekte adresseringskretser.",
        "sapho_functions_title": "Støttede funksjoner, nøkkelord og operatorer er oppsummert i en tabell som viser C-kompilatorens funksjoner.",
        "sapho_table_category_title": "Kategori",
        "table_content_title": "Innhold",
        "sapho_table_keywords": "Søkeord",
        "sapho_table_operators": "Operatorer",
        "sapho_asm_compiler_subtitle": "Assembler-kompilatoren har 49 instruksjoner og genererer Verilog-filen som beskriver prosessorens maskinvare, sammen med initialiseringsfiler for de tilknyttede minnene. Bygget med GNU Flex, gjenkjenner den effektivt opkoder og operander. Nøkkelfunksjoner inkluderer.",
        "sapho_asm_variable_title": "Instruksjon og variabelgjenkjenning:",
        "sapho_asm_variable": "det vurderer det totale antallet programinstruksjoner og nødvendige variabler for å allokere riktig størrelse for både program- og dataminne.",
        "sapho_asm_fpf_title": "Foreslått flytende punktformat",
        "sapho_asm_i3e_before": "I digitale kretser er flytende tall typisk representert i henhold til",
        "sapho_asm_i3e_after": "standard, bruker 32 bits for enkel presisjon og 64 bits for dobbel presisjon. Denne standarden inkluderer spesielle tallrepresentasjoner og definerer aritmetiske operasjoner.",
        "sapho_asm_mantissa": "Denne tilnærmingen tillater et fleksibelt utvalg av mantisse- og eksponentverdier, og optimerer prosessorens ytelse ved håndtering av flyt-komma-aritmetikk.",
        "sapho_media_resources_note": "For mer detaljert innsikt i SAPHO, se videoene ovenfor eller utforsk flere artikler og ressurser nedenfor.",
        "sapho_references_title": "Referanser",
        "sapho_references_subtitle": "Denne delen inkluderer ressurser om prosessorarkitektur, fremskritt innen rask beregning og forskningsartikler for dybdestudier.",
        "sapho_references_intel": "Intel Research - Prosessor og arkitektur",
        "sapho_references_arm": "ARM - prosessorarkitektur",
        "sapho_references_nature": "Naturen - kvanteberegningsgjennombrudd",
        "sapho_references_acm": "ACM Journal on Computing Architectures",
        "sapho_references_i3e": "IEEE - Datamaskinarkitektur",
        "sapho_references_fct": "ACM - Raske beregningsteknikker",
        "sapho_references_hpc": "HPC-ledning - databehandling med høy ytelse",
        "sapho_references_wiki": "Wikipedia - Instruksjonssettarkitektur",
        "sapho_licensed": "Lisensert under",

        "sapho_download_title": "SAPHO-nedlasting | NIPSCERN Lab",
        "sapho_download_text_subtitle": "Skalerbar arkitekturprosessor for maskinvareoptimalisering.",
        "sapho_download_documentation": "Gå til dokumentasjon",
        "sapho_download_back": "Tilbake til hovedsiden",
        "sapho_download_thanks": "Takk for at du lastet ned SAPHO!"
        
    },
    "fr": {
        "home_title": "NIPSCERN - Recherche et innovation | Laboratoire NIPSCERN",
        "home_btn_search": "Rechercher",
        "home_welcome": "Bienvenue au NIPSCERN",
        "home_current_research": "Recherche en cours",
        "home_supporters": "Supporteurs",
        "home_about_us": "À propos de nous",
        "home_faq": "FAQ",
        "home_contact_us": "Nous contacter",
        "home_title_text": "La fusion du traitement du signal et de la recherche sur les particules",
        "home_subtitle_text": "Collaborer à l'échelle mondiale pour repousser les limites de la physique, de la technologie et de l'innovation.",
        "home_btn_learn_more": "En savoir plus",
        "home_btn_explore_projects": "Découvrir les projets",
        "home_sapho_card": "Programmez des processeurs en C+- avec SAPHO : processeur d'architecture évolutive pour l'optimisation matérielle.",
        "home_read_more": "Lire la suite",
        "home_aura_card": "Un IDE moderne, fonctionnel et esthétique avec IA intégrée pour programmer des processeurs en utilisant le langage C+.",
        "home_alice_card": "Une nouvelle façon optimisée de traduire le code C+ en assembleur. Rapide et fiable.",
        "home_helvetia_card": "Toute la documentation du laboratoire NIPSCERN. Trouvez des instructions, des conseils, des exemples et bien plus encore.",
        "home_infinity_card": "Application tout-en-un qui vous fait gagner du temps après le formatage de votre Windows. Téléchargez des outils utiles.",
        "home_cern_card": "Découvrez-en plus sur le CERN, l'Organisation européenne pour la recherche nucléaire.",
        "home_text_about_us": "Le NIPSCERN est à la pointe de l'innovation dans les domaines du traitement du signal et de la recherche sur les particules, à l'origine de percées qui remodèlent notre compréhension de l'univers.",
        "home_title_our_mission": "Notre mission",
        "home_text_our_mission": "Exploiter les technologies de pointe et la recherche collaborative pour faire progresser les connaissances et résoudre des défis scientifiques complexes.",
        "home_title_our_vision": "Notre vision",
        "home_text_our_vision": "Être un leader mondial de la recherche et de l'innovation, inspirant les générations futures à explorer les frontières de la science.",
        "home_title_join_us": "Rejoignez-nous dans notre voyage !",
        "home_text_join_us": "Ensemble, nous pouvons libérer de nouveaux potentiels dans la recherche et la technologie. Explorez nos projets ou impliquez-vous ! »",
        "home_title_faq": "Questions fréquemment posées",
        "home_text_faq_q_1": "Où se trouve le laboratoire NIPSCERN ?",
        "home_text_faq_a_1": "Le laboratoire NIPSCERN est situé à l'Universidade Federal de Juiz de Fora, dans l'État du Minas Gerais, au Brésil.",
        "home_text_faq_q_2": "Quels projets le NIPSCERN a-t-il développés ?",
        "home_text_faq_a_2": "Nous avons développé une variété de projets comme AURA IDE, SAPHO, Infinity Manager, et bien plus encore.",
        "home_text_faq_q_3": "Comment puis-je aider le laboratoire ?",
        "home_text_faq_a_3": "Vous pouvez nous rejoindre sur notre GitHub situé au pied de page.",
        "home_title_get_touch": "Contactez-nous",
        "home_text_send_message": "Envoyer un message",
        "home_text_contact_info": "Coordonnées",
        "home_privacy_policy": "Politique de confidentialité",
        "home_terms_service": "Conditions d'utilisation",
        "home_footer_license": "Cette œuvre est sous licence",


        "cern_title": "Histoire du CERN et projet ATLAS | Laboratoire NIPSCERN",
        "cern_nav_history": "Histoire du CERN",
        "cern_nav_atlas": "Projet ATLAS",
        "cern_nav_media": "Médias et ressources",
        "cern_nav_references": "Références",
        "cern_header_text": "Histoire du CERN et projet ATLAS",
        "cern_subtitle": "Comprendre l'univers grâce à la physique des particules.",
        "cern_intro_text": "Histoire du CERN",
        "cern_intro_cern": "Le CERN, l'Organisation européenne pour la recherche nucléaire, a été fondée en 1954 par 12 pays européens dans le but d'établir une installation de recherche de classe mondiale pour explorer les mystères de l'univers. Aujourd'hui, c'est l'un des centres de recherche scientifique les plus grands et les plus respectés au monde, avec 23 États membres et de nombreux partenariats mondiaux. Le CERN est principalement situé à Genève, en Suisse, avec ses installations à cheval sur la frontière franco-suisse.",
        "cern_intro_mission": "La mission du CERN est de fournir aux physiciens les outils et l'infrastructure nécessaires pour mener des expériences révolutionnaires dans la recherche sur les particules subatomiques, faisant progresser notre compréhension de l'univers. L'organisation a été à l'avant-garde de plusieurs réalisations scientifiques monumentales.",
        "cern_section_location_title": "Emplacement",
        "cern_section_location": "Le campus principal du CERN est situé à la frontière franco-suisse, près de Genève, en Suisse. Le Grand collisionneur de hadrons (LHC), le plus célèbre de ses accélérateurs de particules, est situé sous terre dans un tunnel circulaire de 27 kilomètres (17 miles), avec des parties en Suisse et en France.",
        "cern_section_image_lhc": "Image : emplacement souterrain du LHC et des quatre principales expériences.",
        "cern_section_achievements_title": "Réalisations",
        "cern_section_achievements": "Le CERN a contribué de manière significative à la physique des particules, non seulement par des découvertes, mais aussi par le développement de technologies qui ont un impact sur la société dans son ensemble. L'une des réalisations les plus remarquables du CERN est la construction du Grand collisionneur de hadrons (LHC), l'accélérateur de particules le plus grand et le plus puissant au monde, situé à 100 mètres sous terre. Le LHC a permis aux scientifiques de mener des expériences qui ont élargi notre compréhension de la physique des particules et des forces qui régissent l'univers.",
        "cern_section_image_ccc": "Image : le centre de contrôle des accélérateurs du CERN (CCC), où les scientifiques surveillent et contrôlent le fonctionnement du Grand collisionneur de hadrons et d'autres accélérateurs du laboratoire.",
        "cern_section_milestones_title": "Étapes clés",
        "cern_milestone_1954": "Le CERN est fondé par 12 pays européens.",
        "cern_milestone_1989": "Tim Berners-Lee invente le World Wide Web au CERN pour répondre à la demande de partage d'informations entre physiciens travaillant dans différentes parties du monde.",
        "cern_milestone_2008": "le Grand collisionneur de hadrons (LHC), l'accélérateur de particules le plus puissant au monde, entre en service.",
        "cern_milestone_2012": "découverte du boson de Higgs, une particule jalon important dans la physique des particules qui confirme l'existence du champ de Higgs, un élément clé du modèle standard de la physique des particules.",
        "cern_section_image_structure": "Image : un diagramme montrant la structure organisationnelle du CERN, mettant en évidence ses différents départements et collaborations.",
        "cern_section_discoveries_title": "Découvertes et expériences importantes",
        "cern_discovery_intro": "Les découvertes du CERN ont révolutionné notre compréhension de la physique des particules. Voici quelques-unes des expériences et découvertes les plus importantes :",
        "cern_discovery_higgs_title": "La découverte du boson de Higgs (2012) :",
        "cern_discovery_higgs": "l'une des expériences les plus célèbres menées au CERN a été la recherche du boson de Higgs. Cette particule insaisissable était censée donner de la masse à d'autres particules. Après des décennies de recherche, le boson de Higgs a finalement été détecté en 2012 par les détecteurs ATLAS et CMS du LHC. Cette découverte a valu aux scientifiques François Englert et Peter Higgs le prix Nobel de physique en 2013.",
        "cern_discovery_web_title": "Le World Wide Web (1989) :",
        "cern_discovery_web": "Tim Berners-Lee, un scientifique britannique travaillant au CERN, a inventé le World Wide Web pour permettre aux chercheurs du monde entier de partager et d'accéder aux données. Cette invention a depuis transformé la communication, le commerce et la connectivité mondiale.",
        "cern_discovery_antimatter_title": "Expériences sur l'antimatière :",
        "cern_discovery_antimatter": "Le CERN est également connu pour ses recherches sur l'antimatière. En 1995, les scientifiques du CERN ont créé les premiers atomes d'antihydrogène. La compréhension de l'antimatière pourrait conduire à des percées dans des domaines allant de l'énergie à la technologie médicale.",
        "cern_discovery_quark_gluon_title": "Plasma quark-gluon :",
        "cern_discovery_quark_gluon": "L'expérience ALICE du CERN a joué un rôle déterminant dans l'étude du plasma quark-gluon, un état de la matière qui aurait existé juste après le Big Bang. En faisant entrer en collision des ions lourds à des énergies extrêmes, les scientifiques du CERN recréent des conditions similaires à celles du la naissance de l'univers.",
        "cern_section_curiosities_title": "Curiosités sur le CERN",
        "cern_curiosity_data_title": "Traitement des données :",
        "cern_curiosity_data": "Le CERN génère d'énormes quantités de données, environ 30 pétaoctets (30 millions de gigaoctets) par an, qui sont traitées par un réseau mondial de centres de calcul.",
        "cern_curiosity_detector_title": "Le détecteur Atlas :",
        "cern_curiosity_detector": "Le détecteur ATLAS du CERN mesure 45 mètres de long, 25 mètres de diamètre et pèse autant que la tour Eiffel !",
        "cern_curiosity_collaboration_title": "Collaboration internationale :",
        "cern_curiosity_collaboration": "Le CERN emploie des scientifiques de plus de 100 nationalités différentes, favorisant un environnement mondial pour le progrès scientifique.",
        "cern_curiosity_black_holes_title": "Théories sur les trous noirs :",
        "cern_curiosity_black_holes": "Certaines expériences au CERN ont conduit à des spéculations sur la possibilité de créer des micro-trous noirs, bien qu'il n'y ait aucun risque pour la Terre, car de tels trous noirs s'évaporeraient presque instantanément.",
        "cern_atlas_title": "Projet ATLAS",
        "cern_atlas_experiment": "L'expérience ATLAS au CERN est l'une des expériences les plus vastes et les plus complexes jamais construites en physique des particules. Il s'agit d'un détecteur de particules à usage général au Grand collisionneur de hadrons (LHC), conçu pour explorer les particules et les forces fondamentales qui composent l'univers. Grâce à la collaboration de milliers de scientifiques du monde entier, ATLAS contribue à répondre à certaines des plus grandes questions de la physique.",
        "cern_atlas_discovery": "ATLAS a joué un rôle déterminant dans la découverte du boson de Higgs en 2012, une découverte révolutionnaire qui a confirmé l'existence du champ de Higgs, un élément clé du modèle standard de la physique des particules. Au-delà du boson de Higgs, ATLAS vise à détecter une grande variété de phénomènes, tels que des dimensions supplémentaires, la supersymétrie et des particules qui pourraient expliquer la mystérieuse matière noire qui compose une grande partie de l'univers.",
        "cern_atlas_location": "Situé à 100 mètres sous terre, le détecteur ATLAS mesure 46 mètres de long, 25 mètres de diamètre et pèse environ 7 000 tonnes. Sa taille gigantesque lui permet de capturer une large gamme d'interactions entre particules, fournissant aux chercheurs des données inestimables pour mieux comprendre le monde subatomique.",
        "cern_atlas_nipscern_title": "Contribution du NIPSCERN à ATLAS",
        "cern_atlas_nipscern": "Le laboratoire du NIPSCERN participe activement au projet ATLAS. Les chercheurs du laboratoire contribuent à l'analyse des quantités massives de données générées par les collisions de particules au LHC. À l'aide d'outils informatiques et d'algorithmes avancés, les scientifiques du NIPSCERN aident à traiter et à interpréter les données, ce qui est essentiel pour identifier les interactions de particules rares et significatives.",
        "cern_atlas_experiment_image": "Image : une vue de l'immense détecteur de particules de l'expérience ATLAS pendant sa construction au CERN. Le détecteur mesure 46 mètres de long et est chargé de capturer les données des collisions de particules à haute énergie au LHC.",
        "cern_atlas_goal_title": "Objectifs du projet ATLAS",
        "cern_atlas_study_title": "Étudier le boson de Higgs :",
        "cern_atlas_study": "Suite à la découverte du boson de Higgs, ATLAS continue d'étudier ses propriétés plus en détail pour mieux comprendre comment les particules acquièrent de la masse.",
        "cern_atlas_search_title": "À la recherche de la matière noire :",
        "cern_atlas_search": "l'un des objectifs les plus ambitieux d'ATLAS est de découvrir des particules qui pourraient expliquer la matière noire, une forme invisible de matière qui représente environ 27 % de l'univers.",
        "cern_atlas_susy_title": "Enquêter sur la supersymétrie (SUSY) :",
        "cern_atlas_susy": "ATLAS recherche des preuves de supersymétrie, une théorie qui étend le modèle standard en prédisant l'existence de particules partenaires pour chaque particule connue, ce qui pourrait aider à résoudre des mystères comme la matière noire et unifier les forces.",
        "cern_atlas_string_title": "Explorer des dimensions supplémentaires :",
        "cern_atlas_string": "l'expérience recherche des signes de dimensions spatiales supplémentaires, dont des théories comme la théorie des cordes suggèrent qu'elles pourraient exister au-delà des trois dimensions spatiales que nous percevons.",
        "cern_discovery_title": "Découvertes et domaines de recherche importants",
        "cern_discovery_subtitle": "En plus du boson de Higgs, ATLAS a produit des informations importantes dans de nombreux domaines de la physique des particules. Voici quelques contributions notables :",
        "cern_measurement_title": "Mesures de précision :",
        "cern_measurement": "ATLAS a réalisé des mesures précises des processus du Modèle standard, tels que la production des bosons W et Z, qui nous aident à affiner notre compréhension des forces fondamentales.",
        "cern_quark_title": "Études sur le quark top :",
        "cern_quark": "ATLAS a fourni des données clés sur le quark top, la particule élémentaire la plus lourde connue, qui joue un rôle crucial dans les tests du Modèle standard.",
        "cern_model_title": "Nouvelle physique au-delà du Modèle standard :",
        "cern_model": "ATLAS continue d'explorer de nouvelles particules et forces potentielles au-delà du Modèle standard, telles que des particules hypothétiques liées à la matière noire ou des formes exotiques de matière comme le plasma quark-gluon.",
        "cern_discovery_image": "Image : ATLAS fournit la première mesure de la largeur du boson W au LHC.",
        "cern_facts_title": "Faits intéressants sur ATLAS",
        "cern_scale_title": "Échelle de collaboration :",
        "cern_scale": "ATLAS implique environ 3 000 scientifiques de plus de 180 institutions dans 38 pays, ce qui en fait l'un des projets scientifiques les plus collaboratifs de l'histoire.",
        "cern_data_title": "Volume de données :",
        "cern_data": "L'expérience ATLAS produit une quantité massive de données – plus de 10 pétaoctets par an, nécessitant des réseaux informatiques avancés dans le monde entier pour traiter les informations.",
        "cern_detector_title": "Complexité du détecteur :",
        "cern_detector": "ATLAS est composé de plusieurs couches de différents types de détecteurs qui mesurent diverses propriétés des particules, notamment leurs trajectoires, leur énergie et leur impulsion.",
        "cern_media_resources": "Médias et ressources",
        "cern_media_resources_subtitle": "Pour des informations plus détaillées sur les travaux du CERN, regardez les vidéos ci-dessus ou explorez des articles et des ressources supplémentaires ci-dessous.",
        "cern_media_references": "Références",
        "cern_media_references_title": "Cette page comprend des informations provenant de diverses sources, offrant à la fois des aperçus détaillés et des ressources faciles à comprendre sur le CERN et le projet ATLAS :",
        "cern_media_references_cern": "Site officiel du CERN",
        "cern_media_references_atlas": "Aperçu de l'expérience ATLAS",
        "cern_media_references_wiki": "Wikipedia - CERN",
        "cern_media_references_nature": "Article de Nature sur la découverte du boson de Higgs",
        "cern_media_references_wiki_atlas": "Wikipedia - Expérience ATLAS",
        "cern_media_references_higgs": "Serveur de documents du CERN - Article sur la découverte du boson de Higgs",
        "cern_media_references_model": "CERN - Modèle standard de la physique des particules",
        "cern_media_references_matter": "Nature - La chasse pour la matière noire",
        "cern_media_references_exp": "Aperçu des expériences du CERN",
        "cern_media_references_magazine": "CERN Courier Magazine",
        "cern_license": "Sous licence",


        "alice_title": "ALICE - Instruction logique d'assemblage pour le moteur C+ | Laboratoire NIPSCERN",
        "alice_overview": "Présentation",
        "alice_compiler_flow": "Flux de compilation",
        "alice_video_diagram": "Vidéo et diagramme",
        "alice_documentation": "Documentation",
        "alice_title_text": "*ALICE : Instruction logique d'assemblage pour le moteur C+",
        "alice_subtitle_text": "Un moteur d'assemblage innovant optimisé pour le code C+, transformant la logique complexe en instructions optimisées pour les processeurs évolutifs.",
        "alice_documentation_text": "Accéder à la documentation",
        "alice_compiler_flow_text": "Flux de compilation",
        "alice_input": "Votre fichier de code C+ source, le point de départ du processus de compilation.",
        "alice_token": "Décompose le fichier d'entrée en jetons (mots-clés, identifiants, etc.).",
        "alice_parser": "Analyse les séquences de jetons en fonction des règles de grammaire pour créer l'arbre syntaxique.",
        "alice_ast_construction_title": "Construction AST :",
        "alice_ast_construction": "Génère l'arbre de syntaxe abstraite (AST) représentant la structure du programme.",
        "alice_lexical_analysis_title": "Analyse lexicale générée :",
        "alice_lexical_analysis": "La sortie de l'analyseur lexical basée sur les jetons.",
        "alice_parsing_title": "Analyse générée :",
        "alice_parsing": "Logique d'analyse générée, dérivée des règles de grammaire.",
        "alice_handling_title": "Gestion des inclusions :",
        "alice_handling": "Gère toutes les inclusions de fichiers spécifiées dans le code source.",
        "alice_output": "Sortie :",
        "alice_output_title": "Code d'assemblage final, prêt à être exécuté sur le processeur.",
        "alice_flow_comp_title": "La compilation transforme",
        "alice_flow_comp_inter": "en",
        "alice_flow_comp_final": "à travers ces étapes séquentielles.",
        "alice_flow_input_file": "Ceci est le fichier d'entrée.",
        "alice_flow_exe": "Qui va directement à myccompiler.exe",
        "alice_token_process": "Ici, le compilateur commence à tokeniser le flux de texte de test.cmm.",
        "alice_token_generated": "Tokens :",
        "alice_token_stream": "Ensuite, le compilateur *ALICE vérifie si le flux d'entrée de tokens est valide selon la grammaire.",
        "alice_nodes": "Plusieurs nœuds sont créés par la fonction 'create_node'. Dans cet exemple, cinq productions/réductions sont réalisées :",
        "alice_asm_output": "Enfin, le compilateur *ALICE génère le code de sortie ASM en fonction des nœuds créés par la fonction create_node à l'étape précédente.",
        "alice_nodes_title": "Nœuds :",
        "alice_asm_output_text": "Ceci est le fichier de sortie.",
        "alice_video_example_title": "Exemple de vidéo",
        "alice_diagram_flow_title": "Diagramme de flux de compilation",
        "alice_diagram_flow_button": "Afficher le diagramme",
        "alice_features_title": "Fonctionnalités",
        "alice_fast_compilation_title": "Compilation rapide",
        "alice_fast_compilation": "*ALICE compile le code C+ rapidement et efficacement pour des performances optimisées.",
        "alice_multi_file_title": "Prise en charge de plusieurs fichiers",
        "alice_multi_file": "Compilez plusieurs fichiers à la fois avec un suivi précis des erreurs par ligne.",
        "alice_stack_size_title": "Taille de pile personnalisée",
        "alice_stack-size": "Taille de pile ajustable pour un traitement plus rapide et une optimisation matérielle.",
        "alice_processor_title": "Choix du processeur",
        "alice_processor": "Choisissez entre les types de processeur à virgule fixe ou à virgule flottante.",
        "alice_directive_title": "Gestion des directives",
        "alice_directive": "Prend en charge une large gamme de directives avec des paramètres personnalisables.",
        "alice_future_features": "Fonctionnalités futures",
        "alice_enhanced_error_title": "Rapports d'erreur améliorés",
        "alice_enhanced_error": "Rapports d'erreur et d'avertissement plus détaillés.",
        "alice_performance_optm_title": "Optimisation des performances",
        "alice_performance_optm": "Compilation plus rapide et intégrée conseils d'optimisation du code.",
        "alice_plugin_title": "Système de plug-ins",
        "alice_plugin": "Prise en charge des modules complémentaires et des outils créés par la communauté.",
        "alice_stonks_title": "Informations statistiques",
        "alice_stonks": "Suggestions basées sur les données pour l'amélioration du code.",
        "alice_security_title": "Améliorations de la sécurité",
        "alice_security": "Fonctionnalités de fiabilité et de sécurité améliorées.",
        "alice_alice_documentation_title": "Documentation ALICE",
        "alice_alice_documentation": "Recherchez des informations détaillées et des guides sur l'instruction logique d'assemblage ALICE pour le moteur C.",
        "alice_alice_documentation_button": "Lire la documentation",
        "alice_alice_license": "Sous licence",


        "infinity_title": "Infinity Manager | NIPSCERN Lab",
        "infinity_initial_title": "Infinity",
        "infinity_final_title": "Manager",
        "infinity_subtitle": "Gestionnaire de téléchargement pour les outils du laboratoire NIPSCERN",
        "infinity_welcome_title": "Bienvenue dans Infinity Manager, le gestionnaire de téléchargement dédié au laboratoire NIPSCERN. Conçu pour les chercheurs et les développeurs, Infinity Manager simplifie le processus d'accès aux outils logiciels essentiels requis pour les projets innovants dans les domaines du traitement du signal et de la recherche informatique.",
        "infinity_summary_1": "L'objectif principal d'Infinity Manager est de rationaliser l'installation et la gestion des logiciels pour les utilisateurs du laboratoire NIPSCERN. En fournissant une plate-forme centralisée pour télécharger, installer et mettre à jour diverses applications logicielles, Infinity Manager améliore la productivité et garantit que tous les utilisateurs ont facilement accès aux derniers outils nécessaires à leur travail.",
        "infinity_summary_2": "Infinity Manager favorise également la collaboration au sein du laboratoire en permettant un partage et une distribution faciles des logiciels entre les membres de l'équipe. Avec une interface utilisateur intuitive et une documentation complète, les utilisateurs peuvent naviguer sans effort dans les options logicielles disponibles, s'assurant qu'ils ont les bons outils à portée de main pour mener à bien leur projet.",
        "infinity_available_software_title": "Logiciels disponibles :",
        "infinity_available_software": "et d'autres à venir.",
        "infinity_future_software": "Disponibilité future des logiciels : Chez Infinity Manager, nous nous engageons à étendre continuellement notre offre de logiciels pour vous garantir l'accès aux outils les plus efficaces pour vos besoins de développement et de productivité. À l'avenir, nous souhaitons inclure encore plus de programmes qui répondent à divers aspects du développement de logiciels, de l'analyse de données, de la conception et de la collaboration. Restez à l'écoute des mises à jour sur les nouveaux ajouts qui amélioreront encore votre flux de travail et prendront en charge vos projets au laboratoire NIPSCERN.",
        "infinity_open_source": "Importance des logiciels open source : les logiciels open source jouent un rôle essentiel dans le paysage technologique actuel. En donnant accès au code source, ils encouragent la transparence, la collaboration et l'innovation. Les programmes open source permettent aux développeurs de modifier et d'améliorer les logiciels en fonction de leurs besoins uniques, favorisant ainsi une approche communautaire de la résolution des problèmes. ",
        "infinity_do_more": "Explorez, contribuez et innovez : à mesure que nous construisons la plateforme Infinity Manager, nous vous invitons à explorer les offres actuelles et à nous faire part de vos commentaires sur les outils que vous trouvez les plus utiles. Ensemble, nous pouvons créer une ressource qui non seulement répond à vos besoins, mais contribue également à l'écosystème open source florissant.",
        "infinity_thanks": "Merci d'avoir choisi Infinity Manager — votre passerelle vers des solutions logicielles essentielles pour le laboratoire NIPSCERN.",
        "infinity_find_us": "Nous trouver",
        "infinity_learn_more": "En savoir plus",
        "infinity_learn_more_cern": "À propos du CERN",
        "infinity_visit": "Visiter",
        "infinity_visit_cnpq_ufjf": "CNPq et UFJF",
        "infinity_licensed": "Le NIPSCERN est sous licence CC BY-NC-SA 4.0",


        "privacy_title": "Politique de confidentialité | Laboratoire NIPSCERN",
        "privacy_policy_title": "Politique de confidentialité",
        "privacy_last_updated": "Dernière mise à jour : 10.09.2024",
        "privacy_subtitle": "Au laboratoire NIPSCERN, nous respectons votre vie privée et nous engageons à maintenir la transparence. Nous ne collectons, ne stockons ni ne traitons aucune donnée personnelle de nos utilisateurs.",
        "privacy_data_collection_title": "1. Collecte de données",
        "privacy_data_collection": "Le laboratoire NIPSCERN ne collecte aucune information personnelle des visiteurs ou des utilisateurs. Nous n'utilisons pas de cookies, de mécanismes de suivi ou d'outils d'analyse qui collectent des données personnelles.",
        "privacy_third_party_title": "2. Liens vers des tiers",
        "privacy_third_party": "Notre site Web peut contenir des liens vers des sites Web tiers, y compris nos partenaires comme le CNPq, l'UFJF et le CERN. Nous vous encourageons à consulter leurs politiques de confidentialité avant de vous engager avec eux.",
        "privacy_open_source_title": "3. Philosophie Open Source",
        "privacy_open_source": "Tous les projets développés au laboratoire NIPSCERN sont open source. Nous ne suivons ni ne surveillons qui accède ou télécharge nos logiciels.",
        "privacy_rights_title": "4. Vos droits",
        "privacy_rights": "Étant donné que nous ne collectons aucune donnée, il n'existe aucun droit d'utilisateur lié aux informations personnelles dans nos systèmes.",
        "privacy_contact_title": "5. Coordonnées",
        "privacy_contact": "Pour toute question concernant cette politique de confidentialité, veuillez nous contacter à l'adresse contact@nipscern.com.",
        "privacy_back": "Retour à la page principale",

        "service_title": "Conditions de service | NIPSCERN Lab",
        "service_terms_service_title": "Conditions de service",
        "service_last_updated": "Dernière mise à jour : 10.09.2024",
        "service_welcome": "Bienvenue au NIPSCERN Lab ! Notre mission est de créer des projets open source de haute qualité. En accédant ou en utilisant notre site Web, vous acceptez ces conditions de service.",
        "service_acceptance_terms": "1. Acceptation des conditions",
        "service_acceptance_text": "En accédant et en utilisant le site Web ou les projets du NIPSCERN Lab, vous acceptez de vous conformer et d'être lié par ces conditions.",
        "service_open_source_projects": "2. Utilisation de projets open source",
        "service_open_source_text": "Tous les projets développés par le NIPSCERN Lab sont open source et disponibles pour une utilisation sous les licences open source pertinentes.",
        "service_disclaimer_warranties": "3. Clause de non-responsabilité relative aux garanties",
        "service_disclaimer_text": "Le laboratoire NIPSCERN fournit son site Web, ses projets et ses logiciels « tels quels ». Nous ne garantissons pas la fiabilité ou la fonctionnalité des logiciels que nous publions.",
        "service_collaborations": "4. Collaborations",
        "service_collaborations_text": "Nous sommes fiers de collaborer avec le CNPq, l'UFJF et le CERN. Cependant, le laboratoire NIPSCERN fonctionne de manière indépendante et n'est pas responsable des politiques ou des pratiques de ces organisations.",
        "service_limitation_liability": "5. Limitation de responsabilité",
        "service_limitation_text": "Le laboratoire NIPSCERN ne sera pas responsable des dommages résultant de l'utilisation ou de l'impossibilité d'utiliser notre logiciel ou notre site Web.",
        "service_changes_terms": "6. Modifications des conditions",
        "service_changes_text": "Nous nous réservons le droit de mettre à jour ces conditions. L'utilisation continue de notre site Web après que des modifications ont été apportées constitue l'acceptation des conditions révisées.",
        "service_contact_information": "7. Coordonnées",
        "service_contact_text": "Pour toute question concernant ces conditions de service, veuillez nous contacter à contact@nipscern.com.",
        "service_back": "Retour à la page principale",


        "sapho_title": "SAPHO - Processeur à architecture évolutive pour l'optimisation matérielle | Laboratoire NIPSCERN",
        "sapho_nav_introduction": "Introduction",
        "sapho_nav_ide": "IDE",
        "sapho_nav_compiler": "Compilateurs",
        "sapho_nav_media": "Médias et ressources",
        "sapho_nav_references": "Références",
        "sapho_subtitle": "Processeur à architecture évolutive pour l'optimisation matérielle.",
        "sapho_documentation": "Accéder à la documentation",
        "sapho_introduction_title": "SAPHO : une introduction",
        "sapho_introduction": "L'architecture fixe des processeurs Soft Core (PSC) actuellement disponibles est une caractéristique commune à tous. Cela signifie que la même quantité de ressources matérielles est allouée quel que soit le programme intégré. De plus, la taille du mot est fixe et est généralement surdimensionnée. Ce site Web présente un processeur soft-core évolutif développé au Cœur de traitement du signal et d'instrumentation de la Faculté d'ingénierie de l'UFJF (Université fédérale de Juiz de Fora).",
        "sapho_overview_title": "Présentation de SAPHO",
        "sapho_overview_open-source": "SAPHO, qui signifie Scalable Architecture Processor for Hardware Optimization, est un processeur soft-core open source conçu pour allouer automatiquement les ressources matérielles nécessaires pendant le temps de compilation des programmes embarqués. Il est principalement utilisé dans les cadres de traitement multicœurs et a été implémenté dans divers systèmes établis.",
        "sapho_overview_compilers": "La fonctionnalité de SAPHO repose sur ses deux compilateurs, accessibles via son environnement de développement intégré (IDE) principal. Le premier compilateur, C+−, est chargé d'interpréter les programmes écrits dans un sous-ensemble du langage C et de les convertir en langage assembleur. Le deuxième compilateur prend le code assembleur généré par le premier compilateur et le traduit en code machine, allouant les ressources matérielles requises et générant un fichier de configuration en Verilog.",
        "sapho_overview_assembler": "L'assembleur identifie d'abord les instructions produites par le programme écrit par l'utilisateur, puis crée uniquement les ressources matérielles nécessaires à l'exécution. La plupart des configurations, telles que le développement de circuits internes pour l'unité logique arithmétique (ALU), sont automatisées. Les programmeurs peuvent modifier des fonctionnalités supplémentaires, notamment la taille des mots, le type d'ALU (virgule fixe ou virgule flottante) et le nombre de ports d'entrée et de sortie, à l'aide de directives de compilation.",
        "sapho_overview_psc": "Une distinction clé entre SAPHO et les PSC disponibles réside dans sa capacité à ajuster son architecture en fonction du programme implémenté. Cependant, il perd la possibilité de mettre à jour le programme pendant l'exécution. Néanmoins, dans de nombreuses applications actuelles, les avantages de l'optimisation des ressources justifient cette limitation.",
        "sapho_description_title": "Description de SAPHO",
        "sapho_description_harvard": "SAPHO est basé sur une architecture Harvard et présente une conception RISC (Reduced Instruction Set Computer), qui lui permet de déterminer les ressources matérielles nécessaires en fonction de l'application de l'utilisateur. L'unité logique arithmétique (ALU) de SAPHO peut être configurée pour des opérations à virgule fixe et à virgule flottante, et ses systèmes de mémoire (données et programme) présentent des adresses auto-évolutives.",
        "sapho_description_tools": "En plus du processeur lui-même, qui comprend son cœur et deux unités de mémoire, plusieurs outils ont été développés pour faciliter la programmation. Ces outils incluent une interface de développement, un compilateur qui interprète un sous-ensemble du langage C connu sous le nom de C+− et un assembleur.",
        "sapho_advantages_title": "Certains des avantages de l'utilisation du processeur SAPHO incluent :",
        "sapho_advantages_instruction_title": "Exécution d'une seule instruction par cycle d'horloge :",
        "sapho_advantages_instruction": "il peut exécuter une instruction par cycle d'horloge, même dans des routines avec des sauts conditionnels, sans perturber le pipeline, grâce à son architecture de pipeline en trois étapes.",
        "sapho_advantages_alu_title": "ALU configurable :",
        "sapho_advantages_alu": "l'ALU peut être ajustée pour des tailles de mots variables et peut gérer les opérations à virgule fixe et à virgule flottante.",
        "sapho_advantages_resource_title": "Allocation de ressources paramétrée :",
        "sapho_advantages_resource": "les ressources sont allouées de manière paramétrée au moment de la conception, adaptées à l'application spécifique développée.",
        "sapho_advantages_flexibility_title": "Flexibilité de programmation :",
        "sapho_advantages_flexibility": "les utilisateurs peuvent programmer le processeur en utilisant soit un sous-ensemble du langage C, soit directement en langage assembleur.",
        "sapho_architecture_title": "Architecture matérielle de SAPHO",
        "sapho_architecture_blocks": "Les blocs principaux de l'architecture SAPHO sont illustrés dans la figure 1, où les lignes pleines indiquent le flux de données et les lignes pointillées représentent les signaux de contrôle. Les blocs jaune clair sont instanciés automatiquement à la demande, en fonction du programme intégré, tandis que les blocs bleu clair sont toujours instanciés. Comme les deux unités de mémoire sont synchrones, les trois étapes de pipeline requises par le processeur sont représentées dans la figure 2.",
        "sapho_architecture_data": "Les pointeurs pour la pile de données et la pile d'instructions (Stack Pointer et Instruction Pointer) gèrent les opérations de lecture et d'écriture dans leurs piles respectives, qui sont partagées entre les mémoires de données et de programme. Dans la mémoire de données, la pile est utilisée pour le stockage temporaire des données via les instructions PUSH et POP et leurs variantes. Dans la mémoire programme, la pile permet l'utilisation de sous-routines avec des instructions CALL et RETURN.",
        "sapho_architecture_circuits": "Lorsque l'ALU est configurée pour des opérations à virgule flottante, des circuits de transformation entre les représentations à virgule fixe et à virgule flottante sont automatiquement instanciés sur les bus d'entrée et de sortie, permettant au processeur de communiquer avec les périphériques d'E/S à l'aide d'entiers en notation de complément à deux.",
        "sapho_architecture_block_image": "Image : Schéma fonctionnel du processeur SAPHO (1).",
        "sapho_architecture_pipeline_image": "Image : schéma des étapes du pipeline exécutées par SAPHO (2).",
        "sapho_architecture_explanation": "Vous pouvez voir ci-dessous une explication plus détaillée de chaque bloc de processeur illustré dans la figure 1.",
        "sapho_architecture_program": "Mémoire de données et de programme",
        "sapho_code": "Comme mentionné précédemment, les tailles des mémoires de données et de programme sont déterminées par le code écrit. Le compilateur assembleur calcule le nombre d'adresses nécessaires pour stocker toutes les instructions et variables du code du programme, paramétrant ainsi l'instance des mémoires. L'assembleur génère le contenu de ces mémoires et l'enregistre dans des fichiers d'initialisation de mémoire (avec une extension .mif), qui sont instanciés dans le FPGA avec le matériel du processeur.",
        "sapho_program_counter": "Compteur de programme - PC",
        "sapho_program_counter_text": "Ce bloc pointe vers l'emplacement de l'instruction en mémoire à lire dans la mémoire du programme. Pendant l'exécution normale du programme, il est incrémenté après chaque instruction. Lorsqu'une instruction de saut est détectée, elle est chargée avec une valeur spécifique qui fait référence à l'instruction suivante. La taille, en bits, du PC est définie par le compilateur assembleur en fonction de la taille de la mémoire du programme.",
        "sapho_prefetch": "Prélecture",
        "sapho_prefetch_text": "Pendant que le processeur exécute l'instruction en cours, il récupère également l'instruction suivante dans la mémoire du programme (ROM) (1ère étape du pipeline). Il sépare l'opcode de l'opérande, qui sont concaténés dans la ROM, et contrôle le décodeur d'instructions et le compteur de programme.",
        "sapho_decoder_text": "Décodeur d'instructions",
        "sapho_decoder": "Le décodeur d'instructions reçoit l'opcode, l'interprète et envoie les signaux de contrôle corrects, tels que ceux pour l'opération ALU, permettant la sortie de données, l'affectation de valeurs dans le fichier de registres lorsque des tableaux sont utilisés, permettant l'écriture de données dans la mémoire et l'envoi de signaux PUSH et POP au pointeur de pile, entre autres.",
        "sapho_register_text": "Fichier de registre",
        "sapho_register": "Le fichier de registre est créé chaque fois que des tableaux sont utilisés dans le programme de l'utilisateur. Sa fonction est d'indexer correctement les éléments du tableau, en décalant la position mémoire du premier élément pour accéder à la position de l'élément souhaité.",
        "sapho_alu": "Unité logique arithmétique (UAL)",
        "sapho_alu_text": "L'ALU de ce processeur soft-core offre un degré significatif de flexibilité de paramétrage automatisé. En conséquence, la structure du processeur peut être modifiée pour s'adapter à son objectif. L'ALU est automatiquement paramétrée par le compilateur assembleur en fonction des instructions produites par le compilateur C+−, en plus des paramètres sélectionnés par l'utilisateur au moment de la conception, tels que l'arithmétique à virgule fixe ou à virgule flottante et la taille en bits du mot. Les circuits créés automatiquement par l'assembleur se trouvent dans le tableau 2. La troisième colonne indique quels circuits sont créés au sein de l'ALU, tandis que les autres sont créés en externe. Les colonnes suivantes montrent quels circuits sont créés pour les processeurs à virgule fixe ou à virgule flottante. ",
        "sapho_table_instruction": "Instruction",
        "sapho_table_circuit": "Circuit",
        "sapho_table_alu": "UAL",
        "sapho_table_fixed_point": "Virgule fixe",
        "sapho_table_floating_point": "Virgule flottante",
        "sapho_table_division": "Division",
        "sapho_table_bitwise_or": "OU au niveau du bit",
        "sapho_table_greater": "Supérieur à",
        "sapho_table_mod": "Modulo",
        "sapho_table_less": "Inférieur à",
        "sapho_table_equal": "Égal à",
        "sapho_table_bitwise_and": "ET au niveau du bit",
        "sapho_table_logical_and": "ET logique",
        "sapho_table_bitwise_not": "NON au niveau du bit",
        "sapho_table_logical_not": "NON logique",
        "sapho_table_shift_r": "Décalage à droite",
        "sapho_table_shift_l": "Décalage à gauche",
        "sapho_table_arithmetic": "Décalage arithmétique",
        "sapho_table_stack": "Pointeur de pile",
        "sapho_table_indirect": "Adressage indirect",
        "sapho_table_note": "Tableau : instructions et circuits respectifs créés automatiquement.",
        "sapho_software_overview": "Présentation du logiciel SAPHO",
        "sapho_software_conversion": "Cette approche simplifiée permet aux développeurs de convertir efficacement des données de haut niveau Code C+− dans une description matérielle de bas niveau adaptée à l'implémentation FPGA, optimisant le processus de conception matérielle et garantissant que les structures de mémoire nécessaires sont en place pour l'application prévue.",
        "sapho_ide_title": "Présentation de l'environnement de développement intégré (IDE)",
        "sapho_ide_subtitle": "L'IDE du processeur SAPHO, développé en C#, fournit des fonctionnalités essentielles pour la paramétrisation et l'invocation du compilateur. L'interface principale comprend cinq zones clés :",
        "sapho_ide_menu_title": "Barre de menu :",
        "sapho_ide_menu": "offre des options pour créer de nouveaux projets, gérer le projet en cours ou quitter l'application.",
        "sapho_ide_toolbar_title": "Barre d'outils :",
        "sapho_ide_toolbar": "situé sous la barre de menu, il propose des icônes d'accès rapide pour ajouter de nouveaux processeurs et appeler les compilateurs C+− et Assembly.",
        "sapho_ide_tree_title": "Arborescence hiérarchique du projet :",
        "sapho_ide_tree": "affiche tous les processeurs du projet et permet d'accéder aux fichiers C+− et Assembly pour chaque processeur.",
        "sapho_ide_window_title": "Fenêtre de programmation :",
        "sapho_ide_window": "permet aux utilisateurs d'écrire et d'afficher du code en C+− et Assembly, organisé via des onglets ouverts.",
        "sapho_ide_console_title": "Fenêtre de la console :",
        "sapho_ide_console": "affiche les messages de compilation, y compris les erreurs et les avertissements, et indique le nombre d'instructions et de variables après une compilation réussie.",
        "sapho_project_title": "Création d'un nouveau projet",
        "sapho_project_subtitle": "Lors de l'ouverture de l'IDE, les utilisateurs doivent créer un nouveau projet en accédant à Fichier > Nouveau projet, où ils peuvent nommer le projet et sélectionner un répertoire (en évitant les espaces ou les caractères spéciaux). Une fois créé, le projet apparaît dans l'arborescence hiérarchique et des options d'ajout de processeurs deviennent disponibles.",
        "sapho_project_ide_title": "Ajout d'un processeur dans l'IDE",
        "sapho_project_ide_subtitle": "Après avoir créé un projet, les utilisateurs peuvent ajouter un processeur en cliquant sur le bouton activé, qui ouvre l'écran de configuration du processeur. Cet écran comprend quatre champs de configuration principaux.",
        "sapho_project_general_title": "Paramètres généraux :",
        "sapho_project_general_before": "les utilisateurs fournissent un nom pour le processeur, qui sera également utilisé pour les fichiers générés",
        "sapho_project_general_inter_after": "et",
        "sapho_project_general_after": ".",
        "sapho_project_alu_title": "Paramètres ALU :",
        "sapho_project_alu": "les utilisateurs peuvent choisir le nombre de bits pour la représentation à virgule fixe ou spécifier le nombre de bits pour la mantisse et l'exposant dans la représentation à virgule flottante.",
        "sapho_project_memory_title": "Paramètres de la pile mémoire :",
        "sapho_project_memory": "les tailles des piles de données et d'instructions sont définies ici si elles sont utilisées.",
        "sapho_project_io_title": "Paramètres d'entrée/sortie",
        "sapho_project_io": "les utilisateurs établissent le nombre d'adresses d'entrée et de sortie.",
        "sapho_project_config_before": "Tous les paramètres de configuration sont automatiquement écrits sous forme de directives de compilation au début du",
        "sapho_project_config_after": "fichier, servant d'en-tête et influençant les ressources matérielles utilisées.",
        "sapho_project_data_mif_before": "Une fois le processus de compilation terminé (C+− suivi de l'assembleur), deux initialisations de mémoire fichiers",
        "sapho_project_data_mif_inter": "et",
        "sapho_project_data_mif_after": "sont créés, contenant respectivement le contenu des mémoires de données et de programme. De plus, un fichier Verilog est généré, encapsulant les paramètres spécifiés dans l'IDE SAPHO pour l'instanciation matérielle.",
        "sapho_project_figure_title": "Les figures illustrent l'écran de configuration du processeur, la structure du dossier du projet et un organigramme détaillant le processus de création de projet dans SAPHO.",
        "sapho_project_folder_image": "Image : structure du dossier d'un projet dans SAPHO (3).",
        "sapho_project_flow_image": "Image : organigramme du processus de création d'un projet dans SAPHO (4).",
        "sapho_compilers_title": "Compilateurs",
        "sapho_c_compiler_title": "Compilateur C",
        "sapho_sps_title": "Structure du programme à fichier unique :",
        "sapho_sps": "le programme doit être contenu dans un fichier et prend en charge les sous-routines, permettant la création automatique de piles d'instructions pour les retours de fonction et les algorithmes récursifs.",
        "sapho_compiler_pointer_title": "Limitations des pointeurs :",
        "sapho_compiler_pointer": "les pointeurs sont limités à l'indexation de tableaux unidimensionnels de taille fixe pour faciliter le calcul préalable de la taille de la mémoire.",
        "sapho_compiler_memory_title": "Aucune allocation de mémoire dynamique :",
        "sapho_compiler_memory": "cette restriction garantit une utilisation efficace des ressources matérielles. Lorsque des tableaux sont déclarés, le compilateur génère les circuits d'adressage indirect nécessaires.",
        "sapho_functions_title": "Les fonctions, mots-clés et opérateurs pris en charge sont résumés dans un tableau, présentant les capacités du compilateur C.",
        "sapho_table_category_title": "Catégorie",
        "table_content_title": "Contenu",
        "sapho_table_keywords": "Mots-clés",
        "sapho_table_operators": "Opérateurs",
        "sapho_asm_compiler_subtitle": "Le compilateur assembleur comporte 49 instructions et génère le fichier Verilog qui décrit le matériel du processeur, ainsi que les fichiers d'initialisation des mémoires associées. Construit avec GNU Flex, il reconnaît efficacement les opcodes et les opérandes. Les fonctionnalités clés incluent.",
        "sapho_asm_variable_title": "Reconnaissance des instructions et des variables :",
        "sapho_asm_variable": "il évalue le nombre total d'instructions de programme et les variables requises pour allouer la taille correcte à la fois à la mémoire de programme et de données.",
        "sapho_asm_fpf_title": "Format à virgule flottante proposé",
        "sapho_asm_i3e_before": "Dans les circuits numériques, les nombres à virgule flottante sont généralement représentés conformément à la",
        "sapho_asm_i3e_after": "standard, en utilisant 32 bits pour la simple précision et 64 bits pour la double précision. Cette norme inclut des représentations numériques spéciales et définit des opérations arithmétiques.",
        "sapho_asm_mantissa": "Cette approche permet une plage flexible de valeurs de mantisse et d'exposant, optimisant les performances du processeur dans la gestion de l'arithmétique à virgule flottante.",
        "sapho_media_resources_note": "Pour des informations plus détaillées sur SAPHO, regardez les vidéos ci-dessus ou explorez des articles et ressources supplémentaires ci-dessous.",
        "sapho_references_title": "Références",
        "sapho_references_subtitle": "Cette section comprend des ressources sur l'architecture des processeurs, les avancées en matière de calcul rapide et des articles de recherche pour une étude approfondie.",
        "sapho_references_intel": "Recherche Intel - Processeur et architecture",
        "sapho_references_arm": "ARM - Architecture du processeur",
        "sapho_references_nature": "Nature - Découvertes de l'informatique quantique",
        "sapho_references_acm": "ACM Journal on Computing Architectures",
        "sapho_references_i3e": "IEEE - Architecture informatique",
        "sapho_references_fct": "ACM - Techniques de calcul rapide",
        "sapho_references_hpc": "HPC Wire - Calcul haute performance",
        "sapho_references_wiki": "Wikipedia - Architecture du jeu d'instructions",
        "sapho_licensed": "Sous licence",

        "sapho_download_title": "Téléchargement SAPHO | Laboratoire NIPSCERN",
        "sapho_download_text_subtitle": "Processeur d'architecture évolutive pour l'optimisation matérielle.",
        "sapho_download_documentation": "Accéder à la documentation",
        "sapho_download_back": "Retour à la page principale",
        "sapho_download_thanks": "Merci d'avoir téléchargé SAPHO !"
    }
}
