{
  "eixo": "cern",
  "ano": 2005,
  "publicacoes": [
    {
      "id": "cern-2005-01",
      "titulo": "Detecção de Raios Cósmicos Usando Filtragem Ótima",
      "autores": "Luciano M. de Andrade Filho; José Manoel de Seixas; Fernando M. L. de Almeida Jr.",
      "tipo": "congresso",
      "nivel": null,
      "arquivo": "../../../artigos/pdfs/cern/2005/cern-congresso-2005-deteccao-raios-cosmicos-filtragem-otima.pdf",
      "veiculo": "XXVI Encontro Nacional de Física de Partículas e Campos (2005)",
      "palavrasChave": [
        "raios cósmicos",
        "filtragem ótima",
        "MARIACHI",
        "detecção de partículas",
        "sinal-ruído"
      ],
      "resumo": "O trabalho aplica técnicas de filtragem ótima para detecção automática de raios cósmicos no projeto MARIACHI, maximizando a relação sinal-ruído em dados extremamente ruidosos."
    },
    {
      "id": "cern-2005-02",
      "titulo": "Test Station for the CARIOCA FE-chip of the LHCb Muon Detector",
      "autores": "I. Bediaga; G. Cernichiaro; L. M. de Andrade Filho; A. A. Machado; J. Magnin; F. Marujo; J. Miranda; R. Nóbrega; E. Polycarpo; A. Reis; B. Schmidt",
      "tipo": "congresso",
      "nivel": null,
      "arquivo": "../../../artigos/pdfs/cern/2005/cern-congresso-2005-test-station-carioca.pdf",
      "veiculo": "Encontro Nacional de Física de Partículas e Campos (2005)",
      "palavrasChave": [
        "CARIOCA",
        "LHCb",
        "detector de múons",
        "eletrônica front-end",
        "teste de ASIC"
      ],
      "resumo": "O artigo descreve uma estação de testes de eletrônica front-end capaz de caracterizar milhares de ASICs CARIOCA usados no detector de múons do experimento LHCb."
    },
    {
      "id": "cern-2005-03",
      "titulo": "Analisando Sinais de RADAR de Raios Cósmicos Ultra-Energéticos Usando Filtragem Ótima",
      "autores": "L. M. de Andrade Filho; J. M. Seixas; F. M. L. de Almeida Jr.; Cristina S. Vianna; H. Takai",
      "tipo": "congresso",
      "nivel": null,
      "arquivo": "../../../artigos/pdfs/cern/2005/cern-congresso-2005-texto-institucional.pdf",
      "veiculo": "XXIV Encontro Nacional de Física de Partículas e Campos (2005)",
      "palavrasChave": [
        "raios cósmicos",
        "MARIACHI",
        "filtragem ótima",
        "VHF",
        "processamento de sinais"
      ],
      "resumo": "Aplicação de filtros-casados para detecção de raios cósmicos ultra-energéticos usando sinais de RADAR no contexto do projeto MARIACHI, alcançando eficiência de 99% e falso alarme de 0,5%."
    }
  ]
}
